[{"id":"08aa26ce-50f8-11e5-8877-77916ee106e6","created_at":"Tue Sep 01 22:23:36 UTC 2015","title":"Sr. Software Engineer- Big Data","location":"Seattle, WA or Remote","type":"Full Time","description":"<p><p><b>About the Position</b></p>\n\n<p><p>The ideal candidate will be familiar with working in a Linux environment (and able to use the appropriate tools), needs to be fluent with C++ (C++03 is great; familiarity with C++11/14 is a bonus) and have experience with test-driven development. Familiarity with Python and other web API technologies would be a bonus.\n<p>\nWe are constantly innovating new features that require analysis of petabytes of data. That requires us to think of distributed scalable solutions, so we are always looking for those candidates who can think outside the box but still understand the inherent costs and complexities of distributed systems.\n<p>\nWe are also working on different ways of visualizing (via the browser) the state of the overall system to help analyze failure scenarios and develop tools to preemptively spot potential problem states before they become critical.\n<p>\nThe team as a whole is actively involved in development on HBase and Hadoop and feed patches back to the community. There are potential opportunities to become involved in this core work on this bleeding edge technology stack.\n<p>\n<b>About the System</b></p>\n\n<p><p>There are four parts to our main indexing service:</p>\n\n<ul><li>Sorting and prioritizing 200 billion URLs into a schedule</li>\n<li>Crawling the generated schedule and processing individual pages</li>\n<li>Processing the crawled pages and building and inverse link graph: 1,000,000,000,000 links</li>\n<li>Serving the inverse link graph via an API</li>\n<li>Each of these systems is a distributed parallel system running in the cloud (We had to throw \"cloud\" in here somewhere :-) ) that runs on multiple nodes: 10 nodes for part 1, 20 nodes for part 2, 40 Nodes for part 3, and 8 nodes for part 4. We use a custom-built DB as the interface between these four systems.</li>\n<li>The code is written in C++ (Parts 1-3) and Python (Part 4), with a deployment system built with Bash.</li></ul>\n\n<p><p><b>Qualifications:</b>\n<p>\nRequired</p>\n\n<ul><li>BS in Computer Science\n*Or a great reason for not having one, and believe us, there are plenty</li>\n<li>Experience with Linux/Unix environment (you can handle the shell, preferably bash)</li>\n<li>Experience with C++03</li>\n<li>Experience with Python</li>\n<li>At least 2 years of relevant industry experience</li></ul>\n\n<p><p>Nice to Have</p>\n\n<ul><li>MSc/PhD in Computer Science</li>\n<li>Experience with Java</li>\n<li>Experience with scripting languages Ruby/Node/Bash</li>\n<li>Experience with C++11 or C++14</li>\n<li>More than 5 years of relevant industry experience</li>\n<li>Experience debugging multi-threaded/multi-process/distributed applications</li>\n<li>Experience using one or more DB technologies in a production environment</li>\n<li>*SQL is nice</li>\n<li>**NoSQL is very nice</li>\n<li>Knowledge of web services; experience utilizing and creating APIs</li>\n<li>Knowledge of BigTable/Hadoop/HBase</li></ul>\n\n<p><p>\n<b>About Moz</b>\n<p>\nWe build analytics software that gives our users the technical edge towards better marketing on the web. We are dedicated to the future of marketing analytics.  We’re obsessed with it.   We’ve been at it for over 7 years and we’re in it for the long haul.  We’re a leader in our space, growing fast and receiving frequent recognition for our accomplishments (2014 lists include:  Inc 5000, Deloitte Fast 500, and the Puget Sound Business Journal&#39;s fastest growing private companies).\n<p>\nBehind our software is a sea of <a href=”http://moz.com/about/team”>Mozzers</a> with a wide array of personalities, experiences, and expertise.  We’ve worked hard and deliberately to build a cultural roadmap. It’s not just about ping pong games and company parties (though we have those, too!).  Learn more about it below before you apply:</p>\n\n<ul>\n<li><a href=”http://moz.com/about/tagfee”>TAGFEE</a> is the glue that holds us together and binds how we do everything at Moz. As Mozzers, we aspire to live and breathe these values.</li>\n<li>We make the web a better place: (http://moz.com/about) and this is how we do it: (http://moz.com/products).</li>\n<li>Not convinced we are awesome yet? Check out our video “<a href=”https://www.youtube.com/watch?v=_rr2XKYoc30”>Why We Love Moz</a>” and our amazing benefits package.</li></ul>\n\n<p><b>Sneak Peak at the Goodies</b></p>\n\n<ul>\n<li>Competitive salary, 401K, stock options</li>\n<li>Generous time off plus $3,000 per year towards your vacation!!</li>\n<li>Home internet and transportation subsidies</li>\n<li>150% charitable donation match</li>\n<li>And so much more (feel free to grill us about the rest in the interview!)</li></ul>\n\n<p>Why Moz?  Because we love what we do.\n<p>\nMoz is an equal opportunity employer and we are committed to providing a work environment that is free from any form of discrimination. Moz values diversity and fosters mutual respect among its employees.</p>\n","how_to_apply":"<p><a href=\"https://boards.greenhouse.io/moz/jobs/74916?gh_jid=74916\">https://boards.greenhouse.io/moz/jobs/74916?gh_jid=74916</a></p>\n","company":"Moz","company_url":"http://moz.com","company_logo":"http://github-jobs.s3.amazonaws.com/fc1c7768-50f7-11e5-825a-26420c8ad79a.jpg","url":"http://jobs.github.com/positions/08aa26ce-50f8-11e5-8877-77916ee106e6"},{"id":"1369478e-f01d-11e4-9274-e3391a3d8136","created_at":"Tue Sep 01 19:34:13 UTC 2015","title":"Sr. Software Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Crunchyroll is looking for world-class backend engineers to work on our suite of internal APIs. Example services include media and video, user account management, eCommerce, digital publishing, payments social media, and more. The ideal candidate is a full-stack LAMP engineer. Qualified candidates are highly technical and have a knack for building production-quality services for millions of users. They are professional software engineers with strong technical design principles, not hackers. They think before they code, they adhere to principles of software abstraction in API design, and they are cognizant of capabilities as well as limitations in what they build. They are not married to a specific language or implementation, but see the merits in using the right tool for the job.</p>\n\n<p>Responsibilities</p>\n\n<ul>\n<li>Work with other engineers and technical product managers to implement and maintain features for our internal platform</li>\n<li>Improve the reliability of our services via robust testing infrastructure</li>\n<li>Improve the scalability of our services through proper planning and changes to architecture</li>\n<li>Improve the availability of our services through better monitoring, performance reporting, error reporting</li>\n<li>Improve the server response times of our APIs by profiling and identifying bottlenecks and eliminating them</li>\n<li>Improve the security of our systems</li>\n<li>Work with devops and sys admin to deploy new technologies</li>\n</ul>\n\n<p>Requirements</p>\n\n<ul>\n<li>BS in Computer Science</li>\n<li>5+ years working with PHP, Java, or Python, and MySQL</li>\n<li>Strong fundamentals in data structures, algorithms, OS, and networking</li>\n<li>Expertise in RDBMS internals and familiar with scaling techniques</li>\n<li>Proficiency in message queueing systems</li>\n<li>Familiarity with MVC frameworks</li>\n<li>Familiarity with code design principles and common patterns</li>\n<li>Experience in automated testing a plus</li>\n<li>Proficiency in PHP (Symfony) a plus</li>\n<li>Familiarity with NoSQL and other datastores a plus</li>\n<li>Strong communication skills and team player</li>\n</ul>\n\n<p>Benefits</p>\n\n<ul>\n<li>Competitive salary</li>\n<li>Health, dental and vision insurance, 401k, and Commuter benefits</li>\n<li>Fun, passionate and skilled co-workers</li>\n<li>Free lunches 4x/week</li>\n<li>Pet friendly environment</li>\n</ul>\n\n<p>About Crunchyroll, Inc.\nCrunchyroll is a leading global destination and platform for Japanese anime and Asian content. Through applications including Crunchyroll for iPhone, iPad, Android, Playstation®3, Playstation®4, Xbox LIVE®, AppleTV, Roku, Internet-enabled TVs, set-top boxes, affiliate websites and its own streaming website, Crunchyroll delivers more than 25,000 episodes and 15,000 hours of officially-licensed content from leading Asian media producers direct to viewers translated professionally in multiple languages within minutes of TV broadcast.  The company is profitable, and has over 400,000 paid subscribers.\nCrunchyroll was founded in 2006 and is headquartered in San Francisco.  Desired candidate will be a part of an exciting initiative that will directly interact with Crunchyroll and other channel initiatives such as Soompi TV, and CreativeBug, but will be an independent platform offering, which is backed by OTT(er) Media, AT&amp;T and The Chernin Group.</p>\n\n<p>About Otter Media:\nAT&amp;T and The Chernin Group formed Otter Media in April 2014 to acquire, invest in and launch global over-the-top (OTT) video services. With more than $500 million in funding committed to the venture, the alliance positions both companies to take advantage of the rapid growth of online video services, with each party bringing significant and complementary strengths. One of the strategic focuses of the venture is to invest in and build advertising and OTT video services for targeted audiences.\nOtter Media&#39;s portfolio includes a majority stake in Crunchyroll, a leading global subscription and ad-supported video platform for Japanese anime and Korean content, and Creativebug, one of the top go-to sources for high-quality online video arts and crafts instruction.</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/p2g6d0\">How to Apply</a></p>\n","company":"Crunchyroll","company_url":"http://www.crunchyroll.com","company_logo":"http://github-jobs.s3.amazonaws.com/0f6baf96-f01d-11e4-9855-a6ff5d05f9c7.png","url":"http://jobs.github.com/positions/1369478e-f01d-11e4-9274-e3391a3d8136"},{"id":"31eb7ed4-50df-11e5-9a20-a63c0e42140d","created_at":"Tue Sep 01 19:26:40 UTC 2015","title":"Sr. Software Engineer at Luna (YC S2015)","location":"New york","type":"Full Time","description":"<p>Luna is an Internet of Things company with a proprietary technology to help you fall asleep faster, elevate your sleep quality, and wake up at your highest energy level. Luna launched on Indiegogo few months ago ($1.4M+ in pre-orders and 6k+ units sold) and just graduated from YC S2015.</p>\n\n<p>We are looking for a Sr. Software Engineer seeking an opportunity at a competitive, rewarding, and high-challenge environment, open to wear many hats at a growing startup. You will be joining the core development team at Luna.</p>\n\n<p>The ideal candidate will have 5+ years of experience in professional software development the majority of which spent doing back-end.</p>\n\n<p>Responsibilities: </p>\n\n<ul>\n<li>Design, implement and debug end-to-end platform features with minimal supervision </li>\n<li>Write prototypes to prove a design </li>\n<li>Work with firmware engineers and with the front-end teams to negotiate api specs</li>\n</ul>\n\n<p>Qualifications: </p>\n\n<ul>\n<li>B.S. or higher in Computer Science (or equivalent work experience) </li>\n<li>Experience with web infrastructure and distributed systems </li>\n<li>Disciplined approach to testing and quality assurance </li>\n<li>Strong algorithms, data structures and coding background </li>\n<li>Experience with software engineering best practices (e.g. unit testing, code reviews, design documentation) </li>\n<li>Must have experience in either node or python </li>\n<li>Must have experience in at least two of: Java, c++, c#, objective c, go </li>\n<li>Experience with Cassandra, Hbase and other horizontally scalable storage systems is a plus </li>\n<li>Experience with embedded development is a plus </li>\n<li>Experience with mobile development is a plus</li>\n</ul>\n\n<p>WHY US?\nLuna is the first technology company that makes any bed smart. You spend 1/3 of your life in bed and everything around you is becoming smarter but not your bed. It is time to have a bed that learns your needs and is able to adapt itself and your house to you and your sleep needs.</p>\n","how_to_apply":"<p>Email your resume to <a href=\"mailto:matteo@lunasleep.com\">matteo@lunasleep.com</a></p>\n","company":"Luna","company_url":"http://www.lunasleep.com","company_logo":"http://github-jobs.s3.amazonaws.com/2ea27700-50df-11e5-8d07-e80ab3142fa7.jpg","url":"http://jobs.github.com/positions/31eb7ed4-50df-11e5-9a20-a63c0e42140d"},{"id":"e75b3bf2-50de-11e5-979c-6d996073d40a","created_at":"Tue Sep 01 19:23:19 UTC 2015","title":"Data Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Clover Health is driving down costs and producing improved health outcomes\nwith a unique health insurance plan. We use sophisticated analytics and\ncustom software to direct our own clinical staff to proactively fill in\ngaps in the care of our members. We have a proven model we&#39;re scaling out.</p>\n\n<p>We&#39;re focusing on elderly and low-income patients that stand to benefit\nfrom our model the most. This puts us in a position to make a major dent in\nhealthcare expense in the United States and reverse an unsustainable,\ndecades-long spending trend.</p>\n\n<p><strong><em>The Job</em></strong></p>\n\n<p>We are looking for Data Engineers to join our team. You&#39;ll be part of a\nteam building data pipelines and tools to support our analytics and\napplication development, with opportunities to touch and explore a wide\nrange of technologies. You will work with data scientists, frontend\nengineers, and healthcare professionals in a unique environment —\nleveraging iterative, technical insights and building tools to improve\nmedical outcomes. We value moving fast, but we do so with a pragmatic\napproach that will allow us to sustain velocity over time.</p>\n\n<p><em><em>Healthcare experience is not required.</em></em></p>\n\n<p><strong><em>Role and responsibilities:</em></strong></p>\n\n<ul>\n<li>Develop and maintain systems for capturing changes to data, ensuring\ncorrectness and consistency.</li>\n<li>Develop batch ingestion (ETL) systems for 3rd party data and internal\nprocesses (data science).</li>\n<li>Create real-time ingestion systems for applications.</li>\n<li>Empower control over these operations.</li>\n<li>Design and implement systems for providing data to stakeholders, ensuring\ncorrectness and consistency.</li>\n<li>Guarantee data freshness and availability.</li>\n<li>Enable visibility into history and provide the ability to identify the\nroot causes of change.</li>\n<li>Ensure compliance with the highest standards of quality - data is forever.</li>\n<li>Advance the organizational understanding of available data, incorporating\nit into improving our view of the world.</li>\n<li>Advocate innovative uses for data, including methodologies, techniques,\nand tools.</li>\n<li>Define and maintain development practices that let us move fast with\nquality — including writing tests and documenting key implementations.</li>\n<li>Assist with continually enhancing operational excellence - deployment,\nmigrations, uptime, performance, etc.</li>\n<li>Work with a wide range of tools and technologies (from Python to\nPostgreSQL) and be able to evaluate technologies for what we are building.</li>\n<li>Promote the cause of Complex Data (in contrast to Big Data).</li>\n</ul>\n\n<p><strong><em>Things we look for in an engineer in addition to our values:</em></strong></p>\n\n<ul>\n<li>A problem solver that gets excited by big, complicated problems</li>\n<li>A pragmatic approach to software that prioritizes delivering value\ncontinuously</li>\n<li>Comfortable with high collaboration; working with a team and domain\nexperts to develop the right solutions</li>\n<li>Enjoy working in a fluid environment, defining and owning priorities that\nadapt to our larger goals</li>\n<li>A genuine interest in what good technology can do to help people</li>\n<li>A positive attitude towards tackling hard problems in an important\nindustry</li>\n</ul>\n","how_to_apply":"<p>Please apply here: <a href=\"http://grnh.se/ql8nsb\">http://grnh.se/ql8nsb</a></p>\n","company":"Clover Health","company_url":"http://www.cloverhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/e18048da-50de-11e5-8975-a4bc45f546e7.png","url":"http://jobs.github.com/positions/e75b3bf2-50de-11e5-979c-6d996073d40a"},{"id":"9c881f22-2006-11e5-98c3-d318d6df7745","created_at":"Thu Aug 27 23:23:28 UTC 2015","title":"Senior Web Application Engineer","location":"Downtown Redwood City, CA - Steps t","type":"Full Time","description":"<p>What Will You Do:</p>\n\n<p>Glint is looking for a senior UI engineer to join our engineering team. Your primary responsibility is to help architect, design and implement key UI components of Glint’s real-time employee engagement platform, including the application tier and the browser. You will also be working with product management and the design team to push the boundaries of what&#39;s possible for a great user experience.</p>\n\n<p>Who You Are:</p>\n\n<ul>\n<li>Minimum of 5+ years of experience building highly interactive, data-driven web applications.</li>\n<li>Expert knowledge of node.js and application frameworks such as Express. </li>\n<li>Strong proficiency with JavaScript and asynchronous programming with its quirks and workarounds.</li>\n<li>Solid understanding of HTML5, CSS and cross browser compatibility issues.</li>\n<li>Solid understanding of web application security and vulnerabilities (such as the OWASP top 10 list)</li>\n<li>Experience working with REST based API services.</li>\n<li>Working knowledge with AngularJS is highly desirable. </li>\n</ul>\n\n<p>More reasons why you’re qualified:</p>\n\n<ul>\n<li>Ability to work in a fast paced startup environment.\nFlexible, open minded, willing to do what it takes to achieve important milestones.</li>\n<li>High engineering standards.</li>\n<li>BS in Computer Science or related fields.</li>\n</ul>\n\n<p>Who we are:</p>\n\n<p>Glint is an early-stage, VC-funded software startup backed by investors such as Norwest Venture Partners, Shasta Ventures, Evan Williams (Twitter) and Geoff Ralston (Y Combinator). Its leaders are seasoned entrepreneurs with a track record of building and growing highly successful companies and teams such as Turn, SuccessFactors, Jaspersoft, Glassdoor, &amp; Altavista. Jim Barnett, the company&#39;s CEO, has led several successful companies. Check out the media buzz about us!</p>\n\n<p>What we are all about:</p>\n\n<p>Glint provides a real-time employee engagement platform that enables companies to improve employee satisfaction, build stronger teams and deliver better results. At its heart, it’s a state-of-the-art interactive communication platform that builds on top of cutting-edge predictive technology, the latest in behavioral science, and superlative design. Our B2B SaaS product just launched and is already being used by well-known customers to re-invigorate workplaces and create happier, more effective teams and thriving organizations. Our company has an extraordinary team of passionate high-tech professionals. The market for Glint is huge, and our customers are seeing powerful results–calling it “transformational”.</p>\n\n<p>Stuff to perk you up even more...</p>\n\n<ul>\n<li>Competitive compensation and full benefits including healthcare, life insurance, PTO and 401K</li>\n<li>Early stage equity play</li>\n<li>MacBook Pro or MacBook Air and 27&quot; Thunderbolt monitor</li>\n<li>Catered lunches and flexible work arrangements</li>\n<li>Learn from smart people and strong leadership</li>\n<li>Work for a dynamic early-stage startup, helping organizations thrive</li>\n<li>Next to Caltrain in downtown Redwood City\n.................................................................................................................................</li>\n</ul>\n\n<p>Glint provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Glint complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p>\n","how_to_apply":"<p><a href=\"https://glint.applytojob.com/apply/2fJf2l/Ui-Engineer.html\">https://glint.applytojob.com/apply/2fJf2l/Ui-Engineer.html</a></p>\n","company":"Glint Inc.","company_url":"http://www.glintinc.com/","company_logo":"http://github-jobs.s3.amazonaws.com/67a8ff38-2006-11e5-8417-5568bb545b0a.png","url":"http://jobs.github.com/positions/9c881f22-2006-11e5-98c3-d318d6df7745"},{"id":"d7bb2f7e-4c4a-11e5-9ffd-b44c252d70c8","created_at":"Wed Aug 26 23:33:51 UTC 2015","title":"Software Engineer – Vector Maps - 40692089","location":"Cupertino, CA","type":"Full Time","description":"<p>Changing the world is all in a day&#39;s work at Apple. If you love innovation, here&#39;s your chance to make a career of it. You&#39;ll work hard. But the job comes with more than a few perks.<br><br><p>Seeking extraordinary coders to work on the server side of vector map display. An ideal position for a strong generalist, you’ll have exposure to a rich variety of topics including computational geometry, graph algorithms, map-reduce, analytics, data compression, client-server protocols, and computer graphics.<br /></p><p>Key Qualifications:<br />•Excellent skills in C++ or Java, and object-oriented design<br />•Broad knowledge of computer science and systems; ability to quickly learn new domains<br />•Solid system development skills in UNIX-type OS (e.g. Linux, Solaris, BSD, OS X)<br />•Excellent problem-solving and analytic skills<br />•Good communication skills and teamwork<br />•Experience with Hadoop would be an asset<br /></p><p>Description:<br />Apple is hiring senior software engineers for our vector maps service. <br /><br />You’ll be working on the cutting edge of GIS technology, crunching massive amounts of geographic data which will be visible\nto customers worldwide. In a fast-paced, continuously-integrated environment, you&#39;ll use your engineering know-how to design robust, flexible software for a mission-critical pipeline, while taking a hands-on approach and working with client engineers to deliver the next generation of Maps features. <br /><br /></p><p>Education:<br />BS or MS in Computer Science or a related field<br /></p><p>Additional Requirements:<br />The following experience is nice to have, but not required:<br />• Navigation or GIS software <br />• Computational geometry or computer graphics<br />• Python<br /><br /></p><br>Apple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=0871b06d28b89e5cf190e00786452e83\"><img border=\"0\" alt=\"Apply\" src=\"http://www2.equest.com/images/applyhere.gif\"/></a> <img src=\"https://ars2.equest.com/?response_id=0871b06d28b89e5cf190e00786452e83&view\" alt=\" \" width=\"1\" height=\"1\"/></p>\n","company":"Apple Inc.","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/d7bb2f7e-4c4a-11e5-9ffd-b44c252d70c8"},{"id":"4f621802-4c38-11e5-997c-0957baa44349","created_at":"Wed Aug 26 21:21:00 UTC 2015","title":"Principal Software Engineer","location":"San Francisco, California","type":"Full Time","description":"<p>About Minted:</p>\n\n<p>Minted is a design marketplace that connects you to the world’s best independent artists to create something one-of-a-kind. Minted’s unique crowdsourced model represents a modern marketplace – one where the community decides what goods are showcased and sold. This model ensures fresh, on-trend designs are continuously being added to Minted. Our community of independent artists and designers spans 48 states and 43 countries. Our art, stationery, and textiles products have reached over 40 million homes worldwide. Minted is funded by Benchmark Capital, IDG Ventures, Menlo Ventures, Technology Crossover Ventures, and Norwest Venture Partners, along with angels Marissa Mayer, CEO of Yahoo!, Jeremy Stoppelman, CEO of Yelp, and Yishan Wong, former CEO of Reddit. We are headquartered in San Francisco, CA. </p>\n\n<p>About the Role:</p>\n\n<p>Minted is seeking a talented principal software developer with a strong vision who is looking for the opportunity to express that vision across Minted.  You’ll help design and implement a top tier 1 ecommerce platform, helping it scale 100x beyond its current load. You will develop your vision and teach our talented engineering team how to build it while enabling independent artist all over the world to bring their talent to consumers.</p>\n\n<p>Specific Responsibilities:</p>\n\n<p>Create strong object oriented designs, both for module and service level interactions</p>\n\n<p>Serve as a technical lead on our most demanding, cross-functional projects.</p>\n\n<p>Consistently create clean code and teach best practices to junior engineers</p>\n\n<p>Dive deep understanding our complex eCommerce systems to derive root causes and propose fundamental changes</p>\n\n<p>Design both large and small changes to existing software, and decide which is needed</p>\n\n<p>This is a startup!  You will get lots of opportunity to show off your design skills in a large and complex environment with great growth potential</p>\n\n<p>Find operational problems through dashboards and alarming.</p>\n\n<p>Prove success of projects with metrics and reporting</p>\n\n<p>Work with a minimum of technical supervision and supplemental engineering support, while responding efficiently to multiple program priorities</p>\n\n<p>Effectively research and benchmark Minted’s technology against other competing systems in the industry</p>\n\n<p>Contribute intellectual property through patents.</p>\n\n<p>Experience and Skills:</p>\n\n<p>Bachelor’s Degree in Computer Science; Master’s Degree, a plus</p>\n\n<p>8+ years of experience building software in roles of increasing responsibility and technical capability</p>\n\n<p>Ability to present complex technical information in a clear and concise manner</p>\n\n<p>Strong leadership, organizational, and communication skills (verbal and written).</p>\n\n<p>In depth understanding of computer science principles including data structures, programming languages, operating systems, software engineering, databases, hardware, and networking</p>\n\n<p>Bonus points :</p>\n\n<p>Experience developing ecommerce platforms</p>\n\n<p>Familiarity with logging, monitoring, tracking and deployment tools/APIs</p>\n\n<p>Experience programmatically manipulating photos, PDFs, or other graphics formats</p>\n\n<p>Experience with Adobe illustrator or indesign</p>\n","how_to_apply":"<p>Please apply through our webpage at:</p>\n\n<p><a href=\"http://www.minted.com/jobs/list?jvi=oeQD1fws,Job\">http://www.minted.com/jobs/list?jvi=oeQD1fws,Job</a></p>\n","company":"Minted","company_url":null,"company_logo":"http://github-jobs.s3.amazonaws.com/473b199e-4c38-11e5-9b71-78da772336c4.jpeg","url":"http://jobs.github.com/positions/4f621802-4c38-11e5-997c-0957baa44349"},{"id":"8cf31ce8-4b70-11e5-83c1-eb61aab20512","created_at":"Tue Aug 25 21:32:16 UTC 2015","title":"Backend Engineer - Data Team","location":"San Francisco, CA","type":"Full Time","description":"<p><strong>Summary</strong></p>\n\n<p>Grammarly is a bootstrapped, profitable company with millions of registered users. Grammarly’s automated proofreader helps the world’s 2 billion English speakers improve the quality of their writing.</p>\n\n<p>We are looking for talented engineers who will have a big impact on our technical direction. You will join a company where risks and exploration are the norm. You will be part of a team that envisions, collaborates, designs, and develops highly scalable and highly available services to help writers around the world communicate more effectively.</p>\n\n<p>As a Backend Engineer on the Grammarly Data Team, you will work on constructing the Grammarly analytical data pipeline using the coolest building blocks out there and effective creations of your own. You will also be responsible for building out our code metrics, log collection, and querying stack, which in effect will enable other teams to build data pipelines for their services. Your ambition and skill will drive and impact our entire platform. If you want a big challenge, this is your next gig!</p>\n\n<p><strong>What You Will Accomplish</strong></p>\n\n<ul>\n<li>Build internal real-time analytical data acquire-attribute-aggregate pipeline using:\nSpark &amp; Spark Streaming, Reactive Streams\nCassandra\nKafka\nScala</li>\n<li>Build a high-load, big-data, distributed, no-single-point-of-failure, horizontally-scalable, lambda-architecture app</li>\n<li>Build extensible high-load APIs and client-side instrumentation tooling</li>\n<li>Build querying and visualization layer on top of Looker, Tableau and custom web-app</li>\n<li>Perform integration to loop the analytical insights back to Grammarly product</li>\n<li>Relentlessly work to optimize performance and data processing</li>\n<li>Help to improve our development cycle, including CI/CD, deployment, documentation, instrumentation, and monitoring processes</li>\n</ul>\n\n<p><strong>Qualifications</strong></p>\n\n<ul>\n<li>BS or MS in Computer Science or equivalent experience</li>\n<li>Experience writing code in one of the following languages: Java, Scala, Clojure, Lisp, Erlang, Python, C#/C++, Go</li>\n<li>Experience working with relational databases (PostgreSQL, MySQL) as well as a strong grasp of - -NoSQL systems (Cassandra, Redis)</li>\n<li>Experience with asynchronous systems including message queueing (RabbitMQ, Kafka)</li>\n<li>Experience designing and maintaining distributed systems</li>\n<li>Experience building APIs</li>\n<li>Experience crunching data with Hadoop and Spark</li>\n</ul>\n\n<p><strong>Benefits</strong></p>\n\n<ul>\n<li>401(k), Medical, Dental, Vision</li>\n<li>Subsidized commuting benefits</li>\n<li>We are located in beautiful downtown San Francisco, blocks away from BART</li>\n</ul>\n\n<p><strong>About Grammarly</strong></p>\n\n<p>Grammarly improves communication among the world’s 2 billion native and non-native English writers. Our flagship product, the Grammarly® Editor, corrects spelling mistakes, checks for more than 250 common grammatical errors, enhances vocabulary usage, and provides citation suggestions. Millions of registered users worldwide trust Grammarly’s products, which are also licensed by more than 600 leading universities and corporations. Grammarly is an Inc. 500 company with offices in San Francisco and Kyiv.</p>\n","how_to_apply":"<p><a href=\"https://boards.greenhouse.io/grammarly/jobs/81374#.Vdzc951Viko\">https://boards.greenhouse.io/grammarly/jobs/81374#.Vdzc951Viko</a></p>\n","company":"Grammarly","company_url":"http://www.grammarly.com","company_logo":"http://github-jobs.s3.amazonaws.com/7ecaf6b8-4b70-11e5-818d-38045a004178.png","url":"http://jobs.github.com/positions/8cf31ce8-4b70-11e5-83c1-eb61aab20512"},{"id":"b71da162-4b3b-11e5-864e-05344d5f8afc","created_at":"Tue Aug 25 15:13:42 UTC 2015","title":"Application Software Engineer","location":"Columbia, MD","type":"Full Time","description":"<p>Message Systems is looking for a highly motivated full-stack Application Software Engineer to help us design and build applications and user interfaces that support our suite of industry-leading messaging software.  We are an engineering-focused company founded by an engineer and our customers include tech leaders Facebook, Linkedin, Rackspace, Match.com, and Zynga.\nWe currently have several positions available for varying levels of experience. This position is based in Columbia, MD.  Message Systems believes in a fun but focused development environment:</p>\n\n<ul>\n<li>Open floor plan</li>\n<li>Flexible hours</li>\n<li>Outstanding benefits</li>\n<li>Hackathons</li>\n<li>Group activities</li>\n<li>Stocked kitchen and catered lunch once a week</li>\n<li>Equipment includes MacBook Pro</li>\n</ul>\n\n<h2>Responsibilities:</h2>\n\n<ul>\n<li>Work within an agile software engineering team to create software applications that delight our customers.</li>\n<li>Software development includes: Back-end &amp; front-end, database development, UX design, REST APIs.</li>\n<li>Collaboration within the team and with our partners is essential (Product, Project Management, other teams) for all activities: requirements analysis, R&amp;D and prototyping, architecture, estimates, documentation, coding, and testing.</li>\n<li>Unit, functional, and performance testing of backend and front-end code.</li>\n<li>Automation of development, build, and testing process.</li>\n</ul>\n\n<h2>Desired Experience and Qualifications:</h2>\n\n<ul>\n<li>2-5+ years experience building, testing, and deploying high quality, highly reliable, scalable web applications, APIs, and user-interfaces in a team environment. Entry-level candidates will be considered.</li>\n<li>Expertise in server-side development with NodeJS (Express).</li>\n<li>Expertise in client-side development with Javascript (AngularJS, JQuery), HTML, and CSS (Twitter Bootstrap).</li>\n<li>Expertise with Linux.<br></li>\n<li>Experience with and passion for quality-oriented software development best practices including unit and functional testing, automation, continuous integration, and low-dependency architectures.</li>\n<li>Ability to mentor other developers, and otherwise share and collaborate with peers on best practices, testing, and building in quality.</li>\n<li>Must think critically, be outcome oriented, and constantly strive for improving how the team reliably delivers high-quality software.</li>\n<li>Excellent analytical, problem solving, and debugging skills.</li>\n<li>Experience with version control systems, particularly distributed models including Mercurial and Git.</li>\n<li>Knowledge of software design best practices: OOD, SOA, and design patterns.</li>\n<li>Experience with relational (PostgreSQL, Vertica, Infobright) and non-relational databases \n(Cassandra, Hbase) and search engines (ElasticSearch, SOLR)</li>\n<li>Experience with system and data integration and message queues.</li>\n<li>Experience in commercial software products industry is a plus.</li>\n<li>Experience with responsive design is a plus.</li>\n<li>Experience with mobile application development (iOS, Android) is a plus.</li>\n<li>Experience with the following tools is a plus: JIRA, Confluence, Crucible, Bamboo, Grunt, Vagrant, Selenium (testing), Karma (testing), Mocha (testing)</li>\n<li>Bachelor&#39;s Degree in Computer Science or related field or equivalent experience.</li>\n<li>Experience with Agile development.</li>\n</ul>\n","how_to_apply":"<p>Email resume to <a href=\"mailto:jobs@messagesystems.com\">jobs@messagesystems.com</a></p>\n","company":"Message Systems","company_url":"https://www.messagesystems.com/","company_logo":"http://github-jobs.s3.amazonaws.com/af7359de-4b3b-11e5-9296-047559c6ca16.png","url":"http://jobs.github.com/positions/b71da162-4b3b-11e5-864e-05344d5f8afc"},{"id":"e4e79bfe-4b25-11e5-99fc-5ea228b6ea14","created_at":"Tue Aug 25 12:36:52 UTC 2015","title":"Engineering Team Lead","location":"Boston, MA","type":"Full Time","description":"<p>Pixability is looking for startup-minded Team Lead who is inspired to solve interesting problems and deliver great code. If you aren’t afraid of solving complex and challenging technical problems, Pixability is the place for you.</p>\n\n<p>We are looking for someone who can make difficult decisions and take ownership of a problem from end to end. If you have this kind of fire in your gut, talk to us. You will work with a number of cutting-edge technologies and one of the World’s largest Big Data stores - YouTube. You will be asked to architect and develop solutions in areas of distributed performance computing, data processing and analytics.</p>\n\n<p>This is also a fantastic opportunity to bring your technical experience and hands on approach to problem solving to lead a team of highly motivated engineers while promoting engineering best practice at all times. Here are some of the things we look for in candidates:</p>\n\n<ul>\n<li>Successful track record working inside a startup or a small company (agile &amp; dynamic, wearing many hats, excited to build something new and cool, etc) </li>\n<li>At least 10 years of experience building backend software. Computer Science degree is required if less than 15 years of experience as a developer overall. </li>\n<li>At least 2 years of team management, leadership or team mentorship experience. </li>\n<li>You don’t have to be a Python stack services guru, but to really thrive in this role you will need across the board experience : database expertise, back end development techniques with continuous integration and deployment experience - you have to know what can go wrong, in order to fix it.</li>\n</ul>\n\n<p>Required tech skills:</p>\n\n<ul>\n<li>Solid experience building backend software using a Dynamic programming language (ideally Python but Ruby and others are fine as well). </li>\n<li>Comfortable working inside the Linux command line environment. </li>\n<li>Expert-level understanding of the SQL language, query performance considerations, schema design and at least one ORM.</li>\n</ul>\n\n<p>Tech skills as a PLUS:</p>\n\n<ul>\n<li>NoSQL technology such as ElasticSearch, DynamoDB, Hadoop. </li>\n<li>Experience working with columnar storage technologies. </li>\n<li>Relevant market exposure (Advertising, Marketing). </li>\n<li>Experience building Big Data ETL and M/R services. </li>\n<li>Knowledge of best practices in areas of scalable, distributed and redundant system architectures. </li>\n<li>Exposure to SOA and microservices</li>\n</ul>\n\n<p>Pixability Culture</p>\n\n<p>We work hard but cherish a good life-work balance in and out of the office. We enjoy playing foosball and Go, competing in fantasy sports, practicing yoga, and we enjoy weekly happy-hour cocktails. We also have a book club and a running club. Did we mention weekly happy-hour cocktails?</p>\n\n<p>As part of our dedication to the diversity of our workforce, Pixability is committed to Equal Employment Opportunity without regard for race, ethnicity, gender, protected veteran status, disability, sexual orientation, gender identity or religion.</p>\n\n<p>Over the past few years, Pixability has become the top YouTube marketing and advertising platform on the planet. With an audience size that eclipses cable television and other online video platforms, YouTube is now a critical component of any brand CMO’s marketing strategy. In response, we’ve engineered technology that enables the world’s leading brands and agencies to deliver unmatched and fully-transparent brand performance on YouTube. Want to learn more? Here’s a YouTube video about Pixability’s technology: <a href=\"http://pixvid.me/AboutPixability\">http://pixvid.me/AboutPixability</a> ( <a href=\"http://pixvid.me/AboutPixability\">http://pixvid.me/AboutPixability</a> ).</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/3dmxui\">http://grnh.se/3dmxui</a></p>\n","company":"Pixability","company_url":"https://boards.greenhouse.io/pixability/jobs/78842#.VdtBLtNViko","company_logo":null,"url":"http://jobs.github.com/positions/e4e79bfe-4b25-11e5-99fc-5ea228b6ea14"},{"id":"b7ab9758-4a8f-11e5-8782-d83588c1d223","created_at":"Mon Aug 24 18:42:01 UTC 2015","title":"Lead Front-End Software Developer","location":"Iron Mountain, MI or Remote","type":"Full Time","description":"<p>CCI Systems, Inc. is seeking a Lead Front End Software Developer with hands-on front end web application design and development experience. The successful candidate will be part of a team that encourages remove work, has a flexible schedule and well defined and prioritized work for the team in an agile Ruby on Rails/AngularJS development environment. The job includes working closely with a small specialized team of: Developers, Business Analysts, and Production Support. </p>\n\n<p>Duties and Responsibilities:\n● Design and develop core applications for our business (SaaS).\n● Work with other talented engineers to solve real world business and technical problems.\n● Architect, build, test, document, and ship code.\n● Design, implement, build, and utilize RESTful APIs.\n● Use test-driven development techniques to ensure that your code works.\n● Respond to and resolve questions and issues logged by users of a live system.\n● Collaboratively design and build new features.\n● Develop functional prototypes that highlight new design concepts.\n● Seek out new technologies to better solve problems.\n● Practice agile development methods (scrum, XP).</p>\n\n<p>Expected Skills:\n● Computer Science fundamentals: object-oriented design, data structures, algorithm design.\n● Strong software development skills.\n● Deep knowledge of front end technology (JavaScript, HTML and CSS).\n● Familiarity with Angular or other front end frameworks.\n● Experience writing integration and unit tests.\n● Experience with JavaScript build processes and tooling.\n● Advanced Git revision control and build process knowledge.\n● Deep understanding of Web and API architecture.\n● Commitment to transparency, collaboration, embracing change and iterative development.\n● Self-starter with excellent written and verbal communication skills.\n● Familiarity with data architecture concepts and standards.\n● Strong analytical skills.\n● Good interpersonal and communication skills.</p>\n\n<p>Desired Skills:\n● Experience and knowledge implementing solutions on Rails stack.\n● Front-end development experience at a high traffic consumer site.\n● Experience developing and utilizing web services.\n● Familiarity with Agile / Scrum methodologies.\n● Experience building web-based SaaS products. \n● Telecommunications experience a plus.</p>\n","how_to_apply":"<p>Submit resumes to <a href=\"mailto:careers@ccisystems.com\">careers@ccisystems.com</a></p>\n","company":"CCI Systems, Inc.","company_url":"http://www.ccisystems.com/","company_logo":null,"url":"http://jobs.github.com/positions/b7ab9758-4a8f-11e5-8782-d83588c1d223"},{"id":"f7dda53e-4a88-11e5-8563-3a14e2ef7419","created_at":"Mon Aug 24 17:58:31 UTC 2015","title":"Lead Developer - PHP","location":"Chicago, IL or New York City, NY","type":"Full Time","description":"<p><strong>The Position: Lead Developer</strong></p>\n\n<p>The Lead Developer will bring Academic Approach’s Learning and Assessment Management System to life. We’re tech savvy but we need help taking our vision and product to the next level. As the Lead Developer, you will help to create and maintain products that inspire and transform students’ and schools’ exam readiness and college readiness and in doing so, will forever change a student’s trajectory towards college success.</p>\n\n<p>The Lead Developer will need to be a self-starter that is confident in their coding capabilities, a creative thinker, a skilled developer, and a great communicator. You will be the lead developer at Academic Approach, a company that is trusted throughout the education community for its expertise, professionalism, and immense care for student outcome You will have a great opportunity to take on increasing leadership roles, including the potential to build a team around you and eventually be considered for a Chief Technology Officer Position.</p>\n\n<p><strong>Key Responsibilities</strong></p>\n\n<ul>\n<li>Design, create, and maintain a web-based test prep and learning management system that is currently in development</li>\n<li>Provide technical ownership and oversight across all areas of application development from requirements gathering through delivery</li>\n<li>Oversee and perform development in PHP</li>\n<li>Design, code, test, debug, and document software according to the functional requirements</li>\n<li>Oversee and perform analysis, diagnosis, and resolution of errors</li>\n<li>Work closely with the contracted development and design team</li>\n<li>Effectively manage time to include work on multiple projects, tight deadlines, and prioritize assignments as necessary</li>\n</ul>\n\n<p><strong>Experience and Skills Required</strong></p>\n\n<ul>\n<li>3+ years of experience using PHP, HTML, CSS, Javascript, and JQuery to build dynamic web based products </li>\n<li>College Bachelor’s degree preferred: computer science, or related fields and experience</li>\n<li>Demonstrated experience and proficiency in all phases of planning, developing, and maintaining - back-end and front-end systems</li>\n<li>Proven ability and experience with PHP Framework Laravel and Codeigniter</li>\n<li>Proven ability and experience with PostgreSQL and MySQL</li>\n<li>Experience using Git for version control</li>\n<li>Experience with AWS hosting platform</li>\n<li>Great communication skills and demonstrated ability to work with others in a team environment</li>\n</ul>\n\n<p><strong>Experience and Skills Preferred</strong></p>\n\n<ul>\n<li>You’ve built a web app that uses PHP</li>\n<li>You can easily translate a product vision and feedback into your work product</li>\n<li>You have experience working with secure data</li>\n<li>You enjoy interesting and complex problems that require innovation and creative thinking to solve</li>\n</ul>\n\n<p><strong>Location and Work Environment</strong>\nLocation is in our Chicago, IL or New York City offices. Work environment is collaborative, creative, and filled with passionate people working to improve educational outcomes for schools and students. If the candidate is a perfect fit with Academic Approach, we may consider permitting the individual to work remotely. </p>\n\n<p><strong>Compensation</strong>\nAcademic Approach seeks to hire the best and brightest person for the job. We offer competitive wages, which are commensurate with experience and skills. </p>\n\n<p><strong>Equal Opportunity</strong>\n\u2028Academic Approach is an equal opportunity employer.  Background and reference checks are conducted on all prospective new hires.</p>\n\n<p><strong>Application Process\u2028</strong>\nThe application process will include a resume review, phone interview, and in-person interviews. To be considered, please submit your resume and cover letter to <a href=\"mailto:devhiring@academicapproach.com\">devhiring@academicapproach.com</a>.</p>\n\n<p><strong>About Academic Approach</strong></p>\n\n<p>Let’s be honest: tests are standardized; however, students are not. No two students share the same academic strengths, learning style, or personality. </p>\n\n<p>At Academic Approach, we are driven by one mission: to academically support students, families, and school leaders in this ever-changing, never-boring, always thrilling assessment landscape. \nAcademic Approach works closely with families and schools to understand each student, identify his or her specific gaps in knowledge, and customize the most effective test preparation and college readiness solution. </p>\n\n<p><strong>An Academic Approach Type of Person</strong></p>\n\n<p>We are looking for motivated individuals ready to make a massive difference in education and work in a collaborative and fast paced environment. Our organizational culture is shaped for those with the following traits:</p>\n\n<p><strong>Innovator:</strong>  We understand that all great things start with a groundbreaking idea and are followed with diligent and collaborative execution and insight.</p>\n\n<p><strong>Explorer:</strong> We relentlessly pursue the knowledge needed to shape and influence student and school performance.</p>\n\n<p><strong>Problem-Solver:</strong> We are dedicated to finding concrete and actionable solutions to the education challenges facing students. We embrace difficulties with optimism and team work.</p>\n\n<p><strong>Organizer:</strong> We prioritize all of our activities around what’s best for students and schools and organize our activities to turn great ideas into reality.</p>\n\n<p><strong>Builder:</strong> We are committed to the success of the mission. We believe nothing should be done without purpose and a focus on the future. </p>\n","how_to_apply":"<p>To be considered, please submit your resume and cover letter to <a href=\"mailto:devhiring@academicapproach.com\">devhiring@academicapproach.com</a>.</p>\n","company":"Academic Approach","company_url":"http://academicapproach.com","company_logo":"http://github-jobs.s3.amazonaws.com/5064b6da-4a88-11e5-85e9-72346d053c79.png","url":"http://jobs.github.com/positions/f7dda53e-4a88-11e5-8563-3a14e2ef7419"},{"id":"710b37d2-4a52-11e5-91ab-b753ffafb45c","created_at":"Mon Aug 24 11:23:19 UTC 2015","title":"Software QA Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Company Description</p>\n\n<p>Twist Bioscience is a privately-held venture-backed company. The two key investors are ARCH Venture Partners and Paladin Capital Group. The founders of Twist Bioscience are proven entrepreneurs and innovators in the genomics field. Our expertise is synthetic DNA. We have developed a proprietary semiconductor-based synthetic DNA manufacturing process featuring a 10,000-well silicon platform capable of producing synthetic biology tools, such as oligonucleotides, genes, pathways, chassis and genomes. By synthesizing DNA on silicon instead of on traditional 96-well plastic plates, our platform overcomes the current inefficiencies of synthetic DNA production, and enables cost-effective, rapid, high-quality and high throughput synthetic gene production. The Twist Bioscience platform has the potential to greatly accelerate the development of personalized medicine, sustainable chemical production, improved agriculture production as well as new applications such as in vivo diagnostics, biodetection and data storage. For more information, please visit <a href=\"http://www.twistbioscience.com\">www.twistbioscience.com</a>. Twist Bioscience is on Twitter. Sign up to follow our Twitter feed @TwistBioscience at <a href=\"https://twitter.com/TwistBioscience\">https://twitter.com/TwistBioscience</a>.</p>\n\n<p>Join us to power health and sustainability. We offer top of the class compensation with comprehensive benefits. Twist Bioscience is an equal opportunity employer.</p>\n\n<p>Job Description</p>\n\n<p>As a Software QA Engineer at Twist Bioscience, you will have the opportunity to improve the quality of internal and external tools and web applications. You will work closely with the engineering team in a number of different areas such as machine learning, REST APIs, web UI&#39;s, and analysis pipelines. You will be responsible for developing the testing infrastructure as well as the test suites that ensure that target applications satisfy their requirements.</p>\n\n<p>Qualifications</p>\n\n<p>Key Responsibilities:</p>\n\n<ul>\n<li>Collaborate with the development team and internal stakeholders to ensure correct requirements and test coverage</li>\n<li>Develop and run test suites to test Twist&#39;s internal and external applications</li>\n<li>Manage Twist&#39;s software release process</li>\n<li>Use JIRA to manage feature requests and bug fixes</li>\n</ul>\n\n<p>Desired Skills and Background:</p>\n\n<ul>\n<li>BS in Computer Science / Engineering or related field</li>\n<li>3+ years of experience as a software QA engineer</li>\n<li>Web UI test framework experience (Selenium, etc.)</li>\n<li>Prior experience with Agile Methodology</li>\n<li>Release management experience</li>\n<li>Interest in biotech, DNA, synthetic biology</li>\n</ul>\n\n<p>Additional Information</p>\n\n<p>Twist Bioscience is an equal opportunity employer.  Please apply to <a href=\"http://grnh.se/ljbnv4\">http://grnh.se/ljbnv4</a>.</p>\n","how_to_apply":"<p>Please Apply Online at: <a href=\"https://www.smartrecruiters.com/TwistBioscience/84828533-software-qa-engineer\">https://www.smartrecruiters.com/TwistBioscience/84828533-software-qa-engineer</a></p>\n","company":"Twist Bioscience","company_url":"https://www.twistbioscience.com/","company_logo":"http://github-jobs.s3.amazonaws.com/59f41c8a-4a52-11e5-9489-0aa6ec09cc8e.jpg","url":"http://jobs.github.com/positions/710b37d2-4a52-11e5-91ab-b753ffafb45c"},{"id":"f9856b2e-4a51-11e5-9a7a-540bcd12d431","created_at":"Mon Aug 24 11:19:54 UTC 2015","title":"Senior Front-End Software Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Company Description</p>\n\n<p>Twist Bioscience is a privately-held venture-backed company. The two key investors are ARCH Venture Partners and Paladin Capital Group. The founders of Twist Bioscience are proven entrepreneurs and innovators in the genomics field. Our expertise is synthetic DNA. We have developed a proprietary semiconductor-based synthetic DNA manufacturing process featuring a 10,000-well silicon platform capable of producing synthetic biology tools, such as oligonucleotides, genes, pathways, chassis and genomes. By synthesizing DNA on silicon instead of on traditional 96-well plastic plates, our platform overcomes the current inefficiencies of synthetic DNA production, and enables cost-effective, rapid, high-quality and high throughput synthetic gene production. The Twist Bioscience platform has the potential to greatly accelerate the development of personalized medicine, sustainable chemical production, improved agriculture production as well as new applications such as in vivo diagnostics, biodetection and data storage. For more information, please visit <a href=\"http://www.twistbioscience.com\">www.twistbioscience.com</a>. Twist Bioscience is on Twitter. Sign up to follow our Twitter feed @TwistBioscience at <a href=\"https://twitter.com/TwistBioscience\">https://twitter.com/TwistBioscience</a>.</p>\n\n<p>Join us to power health and sustainability. We offer top of the class compensation with comprehensive benefits. Twist Bioscience is an equal opportunity employer.</p>\n\n<p>Job Description</p>\n\n<p>Twist Bioscience is currently seeking a Senior Front-End Software Engineer who is motivated to combine the art of design with the art of programming. Responsibilities will include translation of the UI/UX design wireframes to actual code that will produce visual elements of the application. You will work with the UI/UX designers and bridge the gap between graphic design, UX design and technical implementation, taking an active role on both sides and defining how the application looks as well as how it works.</p>\n\n<p>As the first member of our front-end team you bring expert knowledge of current web technologies. We expect you to be a key contributor to the technical architecture from the onset, own key framework components and work closely with the rest of the team to deliver the initial product.</p>\n\n<p>The ideal candidate would possess expert knowledge of current web technologies, and s/he has a proven track record of working with a team building complex applications.</p>\n\n<p>Qualifications</p>\n\n<p>Required Technical Skills:</p>\n\n<ul>\n<li>5+ years of focused front-end web UI development</li>\n<li>Expert-level command of HTML5, CSS3 and JavaScript</li>\n<li>Extensive prior work experience with React.js, Backbone.js, ExtJS, AngularJS, jQuery, Prototype</li>\n<li>Current knowledge of web technologies and developing trends in relevant fields and emerging standards</li>\n<li>Strong problem-solving skills and ability to think creatively</li>\n<li>3+ years of experience developing web UI against RESTful web services</li>\n<li>Excellent written and verbal communication skills</li>\n</ul>\n\n<p>Required Soft Skills:</p>\n\n<ul>\n<li>Energetic and motivated self-starter</li>\n<li>Ability to learn quickly in a fast-paced start-up environment</li>\n<li>Strong attention to detail and focus</li>\n<li>Work well with others</li>\n<li>Intellectual curiosity and honesty</li>\n</ul>\n\n<p>Additional Desired Skills:</p>\n\n<ul>\n<li>Experience in building mobile apps for iOS and/or Android</li>\n<li>Experience working in life-science organizations (biotech, pharma, genomics, bioinformatics)</li>\n<li>Good understanding of Agile Methodologies</li>\n</ul>\n\n<p>Education:</p>\n\n<ul>\n<li>Bachelor&#39;s Degree in Computer Science or equivalent work experience.</li>\n</ul>\n\n<p>Additional Information</p>\n\n<p>Twist Bioscience is an equal opportunity employer.  Please apply to <a href=\"http://grnh.se/1rcynu\">http://grnh.se/1rcynu</a>.</p>\n","how_to_apply":"<p>Please Apply Online at: <a href=\"https://www.smartrecruiters.com/TwistBioscience/84827872-senior-front-end-software-engineer\">https://www.smartrecruiters.com/TwistBioscience/84827872-senior-front-end-software-engineer</a></p>\n","company":"Twist Bioscience","company_url":"https://www.twistbioscience.com/","company_logo":"http://github-jobs.s3.amazonaws.com/f40f3a76-4a51-11e5-822b-0092e94d13ce.jpg","url":"http://jobs.github.com/positions/f9856b2e-4a51-11e5-9a7a-540bcd12d431"},{"id":"8c5af4b0-4a51-11e5-9232-4a1c6b521f0d","created_at":"Mon Aug 24 11:16:43 UTC 2015","title":"Python Database Engineer","location":"San Francisco, CA","type":"Full Time","description":"<p>Company Description</p>\n\n<p>At Twist Bioscience, our expertise is synthetic DNA.  The Twist Bioscience platform has the potential to greatly accelerate the development of personalized medicine, sustainable chemical production, improved agriculture production as well as new applications such as in vivo diagnostics, biodetection and data storage.  By synthesizing DNA on silicon instead of on traditional 96-well plastic plates, our platform overcomes the current inefficiencies of synthetic DNA production, and enables cost-effective, rapid, high-quality and high throughput synthetic gene production.  </p>\n\n<p>Join us to power health and sustainability.   We offer top of the class compensation with comprehensive benefits.</p>\n\n<p>Job Description</p>\n\n<p>As a Python Database Engineer, you will be working with the engineering, bioinformatics, and production teams to enhance and extend our Laboratory Information Management System. </p>\n\n<p>Qualifications</p>\n\n<p>Required Experience:</p>\n\n<ul>\n<li>BS in Computer Science / Engineering or related field, MS/PhD preferred </li>\n<li>5+ years industry experience (Python, flask, SQLAlchemy, Javascript/CSS/AJAX)</li>\n<li>Mastery of object-oriented programming concepts, large-scale software architecture, networking and distributed systems, and UNIX/Linux environments</li>\n<li>Relational DB experience (Postgres, Oracle) </li>\n<li>Redis, MongoDB, Celery, RabbitMQ, SQS</li>\n</ul>\n\n<p>Preferred Experience:</p>\n\n<ul>\n<li>Unix, Git / Stash, Agile development, TDD</li>\n<li>Interest in biotech, DNA, synthetic biology</li>\n<li>Tech / Biotech / startup environment</li>\n<li>LIMS / MES implementations. Familiarity with SAP MII / MES a plus.</li>\n<li>AWS</li>\n</ul>\n\n<p>Additional Information</p>\n\n<p>Twist Bioscience is an equal opportunity employer.  Please apply to <a href=\"http://grnh.se/y0jk4b\">http://grnh.se/y0jk4b</a>.</p>\n","how_to_apply":"<p>Please Apply Online at: <a href=\"https://www.smartrecruiters.com/TwistBioscience/84826207-python-database-engineer\">https://www.smartrecruiters.com/TwistBioscience/84826207-python-database-engineer</a></p>\n","company":"Twist Bioscience","company_url":"https://www.twistbioscience.com/","company_logo":"http://github-jobs.s3.amazonaws.com/88b64e9a-4a51-11e5-99d7-0ea9ac8ec31e.jpg","url":"http://jobs.github.com/positions/8c5af4b0-4a51-11e5-9232-4a1c6b521f0d"},{"id":"3220a8a0-4a51-11e5-8ede-38dcca404ae9","created_at":"Mon Aug 24 11:14:25 UTC 2015","title":"Python Software Engineer - Algorithm","location":"San Francisco, CA","type":"Full Time","description":"<p>Company Description</p>\n\n<p>At Twist Bioscience, our expertise is synthetic DNA.  The Twist Bioscience platform has the potential to greatly accelerate the development of personalized medicine, sustainable chemical production, improved agriculture production as well as new applications such as in vivo diagnostics, biodetection and data storage.  By synthesizing DNA on silicon instead of on traditional 96-well plastic plates, our platform overcomes the current inefficiencies of synthetic DNA production, and enables cost-effective, rapid, high-quality and high throughput synthetic gene production.  </p>\n\n<p>Join us to power health and sustainability.   We offer top of the class compensation with comprehensive benefits.</p>\n\n<p>Job Description</p>\n\n<p>As a Python Software Engineer-Algorithms you will be working primarily on the algorithms that power Twist&#39;s core synthesis, assembly, and pricing engines, and will have a passion for big data, high performance algorithms, massively parallel computing, and distributed systems.</p>\n\n<p>Qualifications</p>\n\n<p>Required Experience:</p>\n\n<ul>\n<li>BS/MS in Computer Science / Math / Engineering or related field, PhD preferred</li>\n<li>5+ years industry experience (Python, cython, C/C++, numpy, scipy, networkx, scikit-learn)</li>\n<li>Algorithm development, graph theory</li>\n<li>Strong software engineering skills (Python, Java, or equivalent) and exposure to multiple analytics languages (Python, R, or equivalent)</li>\n</ul>\n\n<p>Preferred Experience:</p>\n\n<ul>\n<li>Unix, Git / Stash, Agile development, TDD</li>\n<li>Interest in biotech, DNA, synthetic biology</li>\n<li>Graph visualization</li>\n<li>Relational DB experience (Postgres, Oracle) </li>\n<li>Familiarity with machine learning techniques</li>\n</ul>\n\n<p>Additional Information</p>\n\n<p>Twist Bioscience is an equal opportunity employer. Please apply to <a href=\"http://grnh.se/k2v146\">http://grnh.se/k2v146</a>.</p>\n","how_to_apply":"<p>Please Apply Online at: <a href=\"https://www.smartrecruiters.com/TwistBioscience/84826182-python-software-engineer-algorithm\">https://www.smartrecruiters.com/TwistBioscience/84826182-python-software-engineer-algorithm</a></p>\n","company":"Twist Bioscience","company_url":"https://www.twistbioscience.com/","company_logo":"http://github-jobs.s3.amazonaws.com/2dde4f36-4a51-11e5-8092-1025c50416c6.jpg","url":"http://jobs.github.com/positions/3220a8a0-4a51-11e5-8ede-38dcca404ae9"},{"id":"44d8cce0-4838-11e5-9138-272bfd1da859","created_at":"Fri Aug 21 19:12:07 UTC 2015","title":"Back End Software Engineer","location":"Anywhere","type":"Full Time","description":"<p><strong>Overview:</strong></p>\n\n<p>Are you an innovative back end developer looking to make your mark working for a financial services start-up?  Do you want to be part of the team that will transform the online trading industry?  Tradovate is seeking an experienced and talented Back End Software Engineer who wants to make a difference by pushing the limits of technology.  We are building state of the art solutions for online futures trading by challenging ourselves to deliver a creative, intuitive and scalable user experience to our customers. Successful candidates will be talented technicians and innovative thinkers who are driven to make a difference and help change an industry long held back by yesterday’s technology.</p>\n\n<p><strong>Requirements:</strong></p>\n\n<ul>\n<li>Experience with Scala (primary), Java, C++, JavaScript</li>\n<li>Expertise with Akka, ZeroMQ, Netty, Boost, QuickFIX, Apache Lucene, NodeJS, ReactJS</li>\n<li>Experience with SQL systems (MySQL, Oracle) and NoSQL systems (MongoDB)</li>\n<li>Experience with ELK stack</li>\n<li>Experience with test frameworks like Scalatest and Jasmine</li>\n<li>Experience building/deploying/analyzing distributed and cloud-based infrastructure; Docker and - Docker-based orchestration systems</li>\n<li>Experience with REST, WebSockets and web service design</li>\n<li>Experience with financial protocols like FIX, FAST</li>\n<li>Experience with broadcasting large volumes of real-time data with low latency</li>\n<li>Working knowledge of futures industry, risk calculations</li>\n<li>6+ years of development</li>\n<li>Master Degree in Computer Science</li>\n</ul>\n","how_to_apply":"<p>email resumes to <a href=\"mailto:technology@tradovate.com\">technology@tradovate.com</a></p>\n","company":"Tradovate","company_url":"http://www.tradovate.com","company_logo":"http://github-jobs.s3.amazonaws.com/f53fc36e-4837-11e5-8e81-68e40bb9a5eb.png","url":"http://jobs.github.com/positions/44d8cce0-4838-11e5-9138-272bfd1da859"},{"id":"618c4d34-482a-11e5-9735-e354b2c8cf83","created_at":"Fri Aug 21 17:30:57 UTC 2015","title":"Full-stack JavaScript hacker @ fast growing VC backed start-up","location":"Palo Alto, CA, US","type":"Full Time","description":"<p><p><u>About us:</u></p><p>Our mission is to use software and analytics to bring transparency to the opaque world of jewelry. We are backed by leading VCs including Khosla Ventures, Maveron, and Crosslink. </p><p>Note: we acquired the domain name (Ice.com) a year ago (it is unrelated to the previous company). </p><p><u>A few reasons why you should be interested in this opportunity:</u></p><ul>  <li>The jewelry industry is a fragmented, <strong>$80B market (in the US alone)</strong>, growing at 5 percent+ annually, that software has yet to disrupt. </li> <li>You will be joining an awesome team led by <a href=\"https://www.linkedin.com/pub/brandon-proctor/6/819/b83\">Brandon Proctor</a> (founding CMO of one of the largest e-commerce retailers, Build.com) and <a href=\"http://www.linkedin.com/in/justinyoshimura/\">Justin Yoshimura</a> (3x exits). </li>   <li>We are extremely data driven and technology/software is in our DNA. You won&#39;t be a second class citizen here, guaranteed. </li>   <li>We don&#39;t have time for assholes or politics. </li>    <li>Competitive compensation package including stock options. </li>    <li>Small (17 person) and agile team. </li></ul><p><u>What we&#39;d like to see:</u></p><ul>  <li>True, full-stack engineers with <strong>2+ years of production experience in Python/Django or Node.js strongly preferred.</strong></li> <li>Strong foundation in computer science, with competencies in data structures, algorithms, databases, software design and dev ops.</li> <li>Work experience with relational databases and SQL.</li> <li>Experience with agile development process in collaborative environment.</li>    <li>BS in Computer Science, Engineering, Mathematics, or Physics OR 4 years of relevant work experience.</li>  <li>Good understanding of performance tradeoffs.</li></ul><p><u>Bonus Points:</u></p><ul>  <li>We are currently using Magento, an open source e-commerce platform built in Zend PHP - yuck), but we are building a new, badass e-commerce platform in <strong>Django, Angular.js, Node.js </strong>and integrating it with <strong>Netsuite</strong>&#39;s order management tools (no need to re-invent the <em>entire</em> wheel, after all). Related experience is a plus.</li>  <li>if you have an awesome Github repo, open source contributions, or a cool project you can demo, please cut to the front of the line...</li></ul><p><strong><u><strong>Responsibilities:</strong></u></strong></p><p>As a member of our small but seriously talented engineering team, you will play a key role in both shaping and building our technologies. Your scope will be broad, ranging from user-facing features to server-side components and libraries. We are looking for a generalist who enjoys learning and working with different technologies. And of course you will be expected to commit code on your first day. </p><p>*This job description is not meant to be an all-inclusive list of duties and responsibilities, but constitutes a general definition of the position&#39;s scope and function in the company.</p> <img src=\"https://www.applytracking.com/track.aspx/6WAqZ\"/></p>\n","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/6WAqj\">https://www.applytracking.com/track.aspx/6WAqj</a></p>\n","company":"Ice.com","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/618c4d34-482a-11e5-9735-e354b2c8cf83"},{"id":"463b645e-464d-11e5-9d3d-7a50bfedac6c","created_at":"Wed Aug 19 08:36:42 UTC 2015","title":"Software Developers for Back- & Frontend","location":"Hamburg","type":"Full Time","description":"<p><strong>Maritime Data Systems</strong> develops software for the maritime industry.</p>\n\n<p>We design tracking systems, develop routing algorithms, compute traffic &amp; weather data and analyze flow of vessels and cargo. We deal with huge amount of data sets and develop and implement sophisticate algorithms to analyze the data. Our clients are mainly bigger size companies from all areas of the maritime and transportation sector.</p>\n\n<p>We are looking for young, highly motivated, smart developers from different parts of the world to join our team in <strong>Hamburg / Germany</strong>. You can join us,even if you have just finished university or if you want to do an internship or your master thesis in our company.</p>\n\n<p>At the moment we offering several positions for Backoffice and Frontend developers.</p>\n\n<p><strong>-Java Backend Developer</strong></p>\n\n<p><strong>-Javascript (Angular or Bootstrap) Frontend Developer</strong></p>\n\n<p><strong>-Internship (Software Developer)</strong></p>\n\n<p><strong>-Master Thesis (Algorithms &amp; Big Data)</strong></p>\n\n<p>We are looking for candidates with the following skills and experience:</p>\n\n<p><strong>Required skills:</strong></p>\n\n<ul>\n<li>Bachelor or Master Degree in engineering, mathematics, statistics, physics, computer science</li>\n<li>software development skills, for example: Java, Ruby on Rails, Node.js, Angular or JS</li>\n<li>Good English level (spoken and written)</li>\n<li>Passion for software development and great interest in new technologies </li>\n</ul>\n\n<p><strong>Would be a big plus:</strong></p>\n\n<ul>\n<li>Browser side: Javascript, Angular.js, Bootstrap, HTML, CSS</li>\n<li>Knowledge of No-SQL databases: MongoDB, Neo4J</li>\n<li>Proven experience in development of software products (commercial, personal or open source)</li>\n<li>Knowledge of Big Data technologies: Hadoop, Elastic Search</li>\n<li>Visa for Germany / working permission</li>\n</ul>\n\n<p><strong>We offer:</strong></p>\n\n<ul>\n<li>Assistance in a dynamic international team </li>\n<li>Opportunities to learn about the latest Big Data &amp; Webtechnologies </li>\n<li>Wide scope for implementing creative and innovative ideas</li>\n<li>Many opportunities for career-related development plus participation in conferences &amp; bootcamps</li>\n<li>An attractive modern office located directly on Hamburg&#39;s Alster Lake</li>\n<li>Regular team events (e.g. &quot;Friday Lunch&quot;)</li>\n<li>Fitness program – SUP on the lake !!!!</li>\n<li>Support with visas, resettling, accommodation and establishing yourself in Hamburg</li>\n</ul>\n\n<p>Application:\nWe look forward to receiving your application and CV in English via email to <strong><a href=\"mailto:jobs@maritimedatasystems.com\">jobs@maritimedatasystems.com</a></strong> or on our Website <a href=\"http://www.maritimedatasystems.com/career\">www.maritimedatasystems.com/career</a></p>\n\n<p>Maritime Data Systems GmbH\nSchwanenwiek 24\n22089 Hamburg\n040 – 22 86 78 99 0\n<a href=\"http://www.maritimedatasystems.com\">www.maritimedatasystems.com</a></p>\n","how_to_apply":"<p><a href=\"mailto:jobs@maritimedatasystems.com\">jobs@maritimedatasystems.com</a> \nor visit our Website <a href=\"http://www.maritimedatasystems.com/career/\">http://www.maritimedatasystems.com/career/</a></p>\n","company":"Maritime Data Systems GmbH","company_url":"http://www.maritimedatasystems.com/","company_logo":"http://github-jobs.s3.amazonaws.com/645f4ece-464c-11e5-81ec-f91215ee4a99.png","url":"http://jobs.github.com/positions/463b645e-464d-11e5-9d3d-7a50bfedac6c"},{"id":"9a2c0934-45f7-11e5-95e4-183456a23d19","created_at":"Tue Aug 18 22:23:59 UTC 2015","title":"Forward Deployed Engineer - Customer Success Team","location":"San Francisco","type":"Full Time","description":"<p><strong>Summary</strong>\nThis role exists to ensure that all of our customers are successful with their Jut deployments. We’ve built an incredibly powerful analytics platform and need to make sure users are tapping into this power to maximizes Jut’s impact in their organization.</p>\n\n<p>This is the sole customer facing team at Jut and as such, this role is the best parts of sales, part support and part account management. This is a technical customer facing role where your product expertise will be a key factor in customer success.</p>\n\n<p>Jut is located in Downtown San Francisco</p>\n\n<p><strong>Responsibilities</strong></p>\n\n<ul>\n<li>Customers, customers, customers</li>\n<li>Be the main point of contact for customers and evaluators to ensure an awesome customer experience with Jut - work to delight customers both pre-sale &amp; post-sale</li>\n<li>Help customers fix technical challenges (there is little chance of customer delight if the product is not working)</li>\n<li>Help customers understand how they could maximize their usage of Jut in their organizations</li>\n<li>Deliver product demos and other product centric webinars</li>\n<li>Improve the Organization &amp; the Product</li>\n<li>Collect, collate and present product feedback from users and work with Product Management and Engineering in order to shape product direction</li>\n<li>Develop and execute a backlog of projects and experiments to improve Customer Success metrics</li>\n<li>Assist with growth experiments to understand what actions drive adoption and usage and improve evaluator on-boarding, conversion and retention rates</li>\n<li>Work closely with product and engineering to achieve the goals above, from a relationship perspective (embody the voice of the customer internally to help shape our decisions)</li>\n<li>Cultivate customers success stories for use in website, speaking engagements, etc</li>\n</ul>\n\n<p><strong>Measure &amp; Scale</strong></p>\n\n<ul>\n<li>Help define success measurements for Customer Success including a measure of a customer satisfaction (or NPS), customer conversion and retention and product usage metrics</li>\n<li>Scale the impact of Customer Success by creating scalable systems, processes and customer facing material to improve customer experience. Content could include knowledge base articles, tutorials, best practice guides, quick video overviews, solution guides, upgrade guides, etc.</li>\n</ul>\n\n<p><strong>Measurements</strong>\nNaturally we will be using our own analytics platform extensively internally to measure and improve our work. We are focused on holistic measurements shared within the organization so that we are all working towards common objectives; you will have a dramatic impact upon these measurements.</p>\n\n<p>These metrics will likely include the following:</p>\n\n<ul>\n<li>Product usage: we want our customers to engage more and more with our product and you job will be assist in driving great product usage</li>\n<li>NPS or satisfaction: a measure of customer satisfaction or NPS</li>\n<li>Land: (evaluator conversion rate) continually improvement of rate at which evaluators decide to purchase Jut</li>\n<li>Expand: assist with product penetration</li>\n</ul>\n\n<p>Secondary measurements could also include items such as:</p>\n\n<ul>\n<li>Contact rates: reducing customer contact rates while growing conversion rates (optimizing &amp; build to scale)</li>\n<li>Success stories: we need to broadly share the stories of success and this role will need to cultivate and capture those stories</li>\n</ul>\n\n<p><strong>Requirements</strong>\nYou would be a perfect fit if you…</p>\n\n<ul>\n<li>Love getting into deep technology challenges which you can explain in a way your grandparents can understand</li>\n<li>Love helping customers fix problems and make the most of technology</li>\n<li>Have a proven ability to understand complex technology and articulate the value in a clear manner</li>\n<li>Enjoy influencing product development</li>\n<li>Relish making data based decisions and recommendations</li>\n<li>You’re a natural born communicator and collaborator</li>\n<li>Passion, curiosity, a sense of humor and a desire to leave a mark</li>\n<li>Have worked selling or supporting web based enterprise software (bonus points for doing this with big data, analytics or database software)</li>\n<li>4 or more years in a customer facing sales engineering, technical support or similar role</li>\n</ul>\n\n<p>Have a mix of some of these:</p>\n\n<p>Technical background including:</p>\n\n<ul>\n<li>Intermediate skills in operating systems &amp; networking</li>\n<li>Database experience including Hadoop, no-SQL or SQL</li>\n<li>Knowledge of HTML, XML, JavaScript and CSS</li>\n<li>Node.js experience</li>\n<li>Experience with RESTful API</li>\n<li>Basic understanding of UNIX commands (for search, and other command line features)</li>\n<li>AWS experience</li>\n<li>Experience supporting Java applications</li>\n<li>Experience in data analytics / big data</li>\n<li>Working knowledge of DevOps, IT automation, build and release management, etc</li>\n<li>Bachelor&#39;s Degree in Computer Science or equivalent demonstrated experience</li>\n</ul>\n","how_to_apply":"<p>Send resume to <a href=\"mailto:stan@jut.io\">stan@jut.io</a></p>\n","company":"Jut, Inc.","company_url":"http://www.jut.io","company_logo":"http://github-jobs.s3.amazonaws.com/9a668ae2-45f6-11e5-9560-761772806cdb.gif","url":"http://jobs.github.com/positions/9a2c0934-45f7-11e5-95e4-183456a23d19"},{"id":"6bc6a044-45ee-11e5-8ac5-0b1487ce47fe","created_at":"Tue Aug 18 21:18:49 UTC 2015","title":"Senior Software Engineer","location":"San Francisco or Menlo Park","type":"Full Time","description":"<p>Location:  San Francisco or Menlo Park</p>\n\n<p>The successful candidate can choose to be based in our Menlo Park headquarters or our San Francisco office (with travel to Menlo Park)</p>\n\n<p>Are you bored with simply contributing to yet another social networking site or fixing bugs in some large company’s search engine? Do you want to be part of a company creating cutting edge technology that is uncovering the mysteries of life itself? Pacific Biosciences is seeking a talented software engineer to write the RESTful web services  supporting their SMRT (Single-Molecule Real-Time) sequence analysis software suite.  The candidate will develop robust, elegant and efficient software components and APIs to rapidly develop a diversity of scientific software solutions.</p>\n\n<p>Responsibilities:         </p>\n\n<ul>\n<li>   Design and implement foundational software layers including RESTful web-services implemented in Scala and akka for managing sequencing data, designing and executing scientific analyses, user authentication and more.<br></li>\n<li>   Engage in an unusually multi-disciplinary organization of software and hardware engineers, bioinformaticians, chemists, and molecular biologists developing state-of-the-art, single-molecule, genomic analysis systems.</li>\n<li><p>Write design and functional specifications for peer review; adhere to software development standards for coding and unit/functional test coverage.</p>\n\n<p>Position Requirements:         </p></li>\n<li><p>B.S. in computer science, electrical engineering or in physical science disciplines; candidates with a high level of relevant experience will also be considered.</p></li>\n<li><p>Candidates with experience developing RESTful APIs are strongly preferred, especially if implemented in Scala, but also in Python or Java.</p></li>\n<li><p>Experience developing reusable components, automated tests, utilizing formal software development processes and employing best practices.</p></li>\n<li><p>Experience maintaining software projects under source control with p4, git, svn or similar.</p></li>\n<li><p>Experience in the life-sciences tools domain, especially DNA sequencing, is preferred but not required.</p></li>\n<li><p>Preference is shown to candidates that demonstrate the capability to bring solutions beyond the prototype stage for deployment in performance-critical production software.</p></li>\n</ul>\n\n<p>All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, or on the basis of disability, gender identity, and sexual orientation.</p>\n","how_to_apply":"<p><a href=\"http://chj.tbe.taleo.net/chj04/ats/careers/requisition.jsp?org=PACIFICBIOSCIENCES&amp;cws=1&amp;rid=1456\">http://chj.tbe.taleo.net/chj04/ats/careers/requisition.jsp?org=PACIFICBIOSCIENCES&amp;cws=1&amp;rid=1456</a></p>\n","company":"Pacific Biosciences","company_url":"http://www.pacificbiosciences.com/","company_logo":null,"url":"http://jobs.github.com/positions/6bc6a044-45ee-11e5-8ac5-0b1487ce47fe"},{"id":"2a1a3120-45e8-11e5-9e91-8cc761e94d46","created_at":"Tue Aug 18 20:32:32 UTC 2015","title":"Sr. Software Engineer","location":"New York","type":"Full Time","description":"<p><strong>About Us and the Role:</strong></p>\n\n<p>CrowdTwist is seeking a Senior Software Engineer for our growing team based in New York City.  In this role, you will work directly with all areas of our platform while adding new features and new products to the CrowdTwist platform. You will be involved in many different projects as we continue to grow and enhance our platform.  Your work will be in front of millions of people and will directly influence the loyalty program offerings for many of our clients, such as Pepsi, Nestlé, Lancome, Ubisoft and Zumiez.</p>\n\n<p>We are a venture-backed NYC based company that provides the most comprehensive omni-channel loyalty &amp; analytics solutions for industry leading brands. We&#39;re relaxed, experienced, hard driving and are changing our industry.</p>\n\n<p>Your work will span many areas of the CrowdTwist platform, including but not limited to:</p>\n\n<ul>\n<li>The consumer-facing loyalty program experience</li>\n<li>Our RESTful APIs</li>\n<li>Our scalable microservices architecture</li>\n<li>Our client-facing content management applications</li>\n<li>Integrations with social networks (Facebook, Twitter, Instagram, Foursquare, etc) and vendors (PoS, ESP, CRM, Bazaarvoice, OrderGroove, etc)</li>\n<li>Our data-driven, client-customizable JavaScript SDK</li>\n</ul>\n\n<p>This role is for an engineer who loves to roll up their sleeves, dive in, and tackle any problem with speed and precision.  You will be utilizing your experience with object-oriented software design and implementation, data modeling, and building high-performance, highly scalable web and data processing applications.  We operate in an agile manner, so you must thrive in a fast-paced environment and enjoy shipping product.</p>\n\n<p>In this role, you will work with a broad backend tech stack, including but not limited to:</p>\n\n<ul>\n<li>PHP</li>\n<li>Java</li>\n<li>Oracle</li>\n<li>Redis</li>\n<li>MongoDB</li>\n<li>RabbitMQ</li>\n<li>Docker</li>\n<li>Amazon Web Services (EC2, VPC, ELB, S3, RedShift, CloudFront etc.)</li>\n<li>Various third-party services (Twilio, SendGrid, EdgeCast, etc.)</li>\n</ul>\n\n<p><strong>About You:</strong></p>\n\n<ul>\n<li>Have a BA/BS in Computer Science or equivalent experience</li>\n<li>Experience with both compiled and scripting languages</li>\n<li>Have 5+ years of professional experience with one or more of: PHP, Java, Ruby, Python, C, C++</li>\n<li>Know your way around a relational and/or NoSQL database</li>\n<li>Write great code, view it as a craft, and love cranking out solid work</li>\n</ul>\n\n<p>You’ll be working with a large, highly-trafficked, scalable application.  Quality is of extreme importance to us, so you’ll be writing unit and integration tests, which are used in our continuous integration process.  Our QA team will show you no mercy, either — bring your “A&quot; game. You should be back end-focused, but our front end tech stack covers a wide range of JavaScript frameworks and related tools, such as:</p>\n\n<ul>\n<li>Angular</li>\n<li>CoffeeScript</li>\n<li>Jade</li>\n<li>Sass</li>\n</ul>\n\n<p><strong>Bonus points for front end development and systems administration experience.</strong></p>\n\n<p>We have a fun, generous company culture that&#39;s built on our fundamental principle that when you give more, you get more:</p>\n\n<ul>\n<li>Competitive compensation and generous employee benefits package including fully paid Medical, Dental &amp; Vision plans for employees &amp; their dependents!</li>\n<li>Stock options for all employees!</li>\n<li>We bring toys to the office but still think the most fun thing to do is build product</li>\n<li>Collaborative work environment that fosters bonds beyond the workplace</li>\n<li>We treat our people well with employee recognition programs and referral bonuses</li>\n<li>Better than average team building activities such as paintball, go cart racing, shuffleboard, organized sporting teams and off-site retreats. </li>\n<li>Provide lunches, drinks and snacks so our team can be hungry for other things</li>\n<li>Learn from and teach each other at CrowdTwist U</li>\n<li>Dog friendly office environment</li>\n</ul>\n\n<p>If this sounds like you, get in touch. We&#39;re cool, relaxed, experienced, hard driving, changing our industry and looking for smart people like yourself to help tackle tough technical challenges.</p>\n\n<p>This is a full-time position based in our New York City office. Apply by sending us your resume and cover letter. Relocation assistance will be available if needed.</p>\n","how_to_apply":"<p><a href=\"http://www.jsco.re/2-cl\">http://www.jsco.re/2-cl</a></p>\n","company":"CrowdTwist","company_url":"http://www.crowdtwist.com","company_logo":"http://github-jobs.s3.amazonaws.com/e1813968-45e7-11e5-8f6d-cd33b0c75e39.png","url":"http://jobs.github.com/positions/2a1a3120-45e8-11e5-9e91-8cc761e94d46"},{"id":"6ec05496-45e1-11e5-9fa2-ce830b97a836","created_at":"Tue Aug 18 19:44:51 UTC 2015","title":"DevOps Engineer","location":"Multiple Locations","type":"Full Time","description":"<p><strong>About the Team</strong></p>\n\n<p>Stitch Fix has an extensive internal platform for managing our business, from inventory management to warehouse logistics to our own Personal Styling platform, each serving thousands of internal users who run the business every day.  Our public-facing infrastructure is growing as well, helping millions of our customers be their best selves.  It’s all tied together with an array of user-facing applications and back-end services.</p>\n\n<p>We’re ops savvy, but not ops-focused. While we are currently hosting our Rails apps on Heroku and leveraging their add-on ecosystem, we are only married to what works, and are constantly re-evaluating our technical infrastructure.  We aren’t afraid of change if that helps us deliver faster, better, and more reliable solutions to our business partners and customers.</p>\n\n<p>This is where you come in. Stitch Fix needs a Ruby and Rails developer with a keen interest in development tools, technical operations and “developer happiness”.  We have a lot of applications, services, and infrastructure, and we need someone who can be dedicated to make sure it’s meeting the needs of the development team.</p>\n\n<p><strong>About the Role</strong></p>\n\n<p>You’d be walking into a welcoming and diverse environment that is built around partnership, integrity, feedback, responsibility, and innovation. We have over 20 Rails apps and services, hosted on Heroku, and deployed with a high degree of consistency. Our mature engineering team is truly partners to those that run Stitch Fix by providing efficiency &amp; effectiveness with the tools we develop. </p>\n\n<p><strong>You’re excited about this opportunity because you will...</strong></p>\n\n<ul>\n<li>Make application development and deployment easier for the engineering team</li>\n<li>Help us solve thorny problems around performance and fault-tolerance</li>\n<li>Build tools and systems to manage security</li>\n<li>Make sure we’re up-to-date on the best practices of our service providers (Heroku, AWS, etc.)</li>\n<li>Investigate new tools &amp; technologies our team can use to solve problems for the business</li>\n</ul>\n\n<p><strong>We’re excited about you because you have experience with...</strong></p>\n\n<ul>\n<li>Ruby and Rails</li>\n<li>An IAAS or PAAS (Heroku haters need not apply)</li>\n<li>Docker</li>\n<li>UNIX and the command line</li>\n<li>Nice to have - Interest or experience with cloud clustering tools (e.g. Fleet, Kubernetes, Docker Swarm)</li>\n</ul>\n\n<p><strong>You also…</strong></p>\n\n<ul>\n<li>Can work with developers to understand their technical AND business goals.</li>\n<li>Are willing to help developers understand the operational implications of their design decisions.</li>\n<li>View documentation as part of a working system.</li>\n<li>Won’t stop until the problem is solved.</li>\n<li>Keep a level head when diagnosing production problems.</li>\n<li>Aren’t afraid to become an expert in something brand new to you.</li>\n<li>Can evaluate risks involved in technical implementations.</li>\n</ul>\n\n<p><strong>Why you will love working at Stitch Fix</strong></p>\n\n<ul>\n<li>We’re a successful, fast-growing company with a start-up work vibe</li>\n<li>A technologically and data-driven business</li>\n<li>Competitive salaries, generous equity and comprehensive health benefits</li>\n<li>We’re at the forefront of tech and fashion, redefining retail for the next generation</li>\n<li>We’re passionate about our clients and live/breathe the client experience</li>\n<li>We get to be creative on a daily basis</li>\n<li>A smart, experienced leadership team that wants to do it right &amp; is open to new ideas</li>\n<li>We believe in autonomy &amp; reward taking initiative</li>\n<li>We have fun! Free lunches, a fully-stocked snack &amp; drink pantry, regular happy hours, lunch-and-learns, all-hands meetings and fun events.</li>\n</ul>\n\n<p><strong>About Stitch Fix</strong></p>\n\n<p>At Stitch Fix, we’re the first fashion retailer to blend expert styling, proprietary technology and unique product to deliver a refined shopping experience. Using a blend of art and science, we deliver a deeply personalized shopping service to our customers. This novel juxtaposition—at once analytic and artistic, technical and adventurous—attracts an extraordinary collection of talented people who are both thinkers and doers. Our diverse workforce has catalyzed enormous company growth over the past three years in terms of customer satisfaction and service efficacy. We’d love for you to help us carry on the trend.</p>\n","how_to_apply":"<p>Click <a href=\"https://stitchfix.applytojob.com/apply/RuM47h/Devops-Engineer.html?source=Github\">here</a> to apply</p>\n","company":"Stitch Fix","company_url":"http://multithreaded.stitchfix.com/","company_logo":"http://github-jobs.s3.amazonaws.com/15cad6c2-45e1-11e5-8b1a-7d1925bf5bec.jpg","url":"http://jobs.github.com/positions/6ec05496-45e1-11e5-9fa2-ce830b97a836"},{"id":"f02176da-45d9-11e5-9cac-1732c5ebfb2d","created_at":"Tue Aug 18 18:50:04 UTC 2015","title":"Senior software engineer - equity + market salary","location":"Palo Alto, CA, US","type":"Full Time","description":"<p><p><u>About us:</u></p><p>Retail Growth Fund acquired the Ice.com domain in 2014 to launch the best place for women to discover and purchase jewelry. We don&#39;t take any inventory because we&#39;re a marketplace - which means our capital goes towards building IP and acquiring/retaining users. </p><p><u>A few things that make us interesting:</u></p><ul> <li>The jewelry industry is a fragmented, <strong>$80B market (in the US alone)</strong>, growing at 5 percent+ annually, that software has yet to disrupt. </li>  <li>You will be joining an awesome team led by <a href=\"https://www.linkedin.com/pub/brandon-proctor/6/819/b83\">Brandon Proctor</a> and <a href=\"http://www.linkedin.com/in/justinyoshimura/\">Justin Yoshimura</a> (3x exits). </li> <li>We are extremely data driven and technology/software is in our DNA. You won&#39;t be a second class citizen here, guaranteed. </li>   <li>We don&#39;t have time for assholes or politics. </li>    <li>Competitive compensation package including equity in a high growth VC backed start-up (Crosslink, Maveron, Quest, Polaris). Salary/equity is determined based on a sliding scale: if you would like a higher salary, we can issue you less equity, and vice versa. </li>   <li>Small (12 person), growing, and agile team. </li>  <li>$1k gift card to dog food our own marketplace sellers! </li></ul><p><u>What we&#39;d like to see:</u></p><ul>  <li>True, full-stack engineers with extensive experience in Python/Django or Java. (Django is a key part of our stack but we use some Java). </li> <li>Strong foundation in computer science, with competencies in data structures, algorithms, databases, software design and dev ops.</li> <li>Work experience with relational databases and SQL.</li> <li>Experience with agile development process in collaborative environment.</li>    <li>BS in Computer Science, Engineering, Mathematics, or Physics OR 4 years of relevant work experience.</li>  <li>Good understanding of performance tradeoffs.</li></ul><p><u>Bonus Points:</u></p><ul>  <li>We are <strong>currently</strong> using Magento, an open source e-commerce platform built in Zend PHP - yuck), but we are building a new, badass e-commerce platform (Django, Java, Node.js and integrating it with <strong>Netsuite</strong>&#39;s order management tools (no need to re-invent the <em>entire</em> wheel, after all). Related experience is a plus.</li>    <li>MS or PhD</li>  <li>if you have an awesome Github repo, open source contributions, or a cool project you can demo, please cut to the front of the line...</li></ul><p><strong><u><strong>Responsibilities:</strong></u></strong></p><p>As a member of our small but seriously talented engineering team, you will play a key role in both shaping and building our technologies. Your scope will be broad, ranging from user-facing features to server-side components and libraries. We are looking for a generalist who enjoys learning and working with different technologies. And of course you will be expected to commit code on your first day. </p><p>*This job description is not meant to be an all-inclusive list of duties and responsibilities, but constitutes a general definition of the position&#39;s scope and function in the company.</p><p> </p> <img src=\"https://www.applytracking.com/track.aspx/6VeWN\"/></p>\n","how_to_apply":"<p><a href=\"https://www.applytracking.com/track.aspx/6VeWX\">https://www.applytracking.com/track.aspx/6VeWX</a></p>\n","company":"Ice.com","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/f02176da-45d9-11e5-9cac-1732c5ebfb2d"},{"id":"75148da8-45d7-11e5-9f48-5a75be6a63c6","created_at":"Tue Aug 18 18:33:13 UTC 2015","title":"PayScale - Sr. Software Engineer, Web+Mobile Platform ","location":"Pioneer Square, Seattle","type":"Full Time","description":"<p>Senior Software Engineer, Web + Mobile Platform</p>\n\n<p>Location: Seattle, WA\nDepartment: Engineering \nType: Full Time \nRequired Experience: Experienced </p>\n\n<p>Why PayScale?\nWe believe that transparent, fact-based relationships between companies and employees will generate the best outcomes. One way we&#39;re getting there is by crowdsourcing compensation data, crunching it, and delivering best practice solutions to businesses via SaaS products. We&#39;re solving meaningful problems. One example: we can tell people what they should be paid in real-time.</p>\n\n<p>Millions and millions of visitors come to PayScale.com each month. Thousands of customers representing over a million employees subscribe to our services. And we&#39;re only getting started.</p>\n\n<p>What&#39;s it like to work at PayScale? \nLots of laughter. People have lunch together. Wine and board games on Fridays. There is a buzz in the air. Feels like a startup with the stability of an established company.</p>\n\n<p>What does the team do?\nWe’re building significant new features and products using modern technologies while still modernizing our existing codebase. Lots of opportunities to learn new technologies, evangelize them to the broader team (not just developers but sometimes to designers, content writers, and marketing), set best practices, and establish the foundation for the front-end of all sites. Experimentation is highly encouraged.</p>\n\n<p>Recent projects include putting PayScale.com on Amazon CloudFront, incorporating React into the build tools, building a pilot for a new product, and organizing a hack day with our friends at Chef.</p>\n\n<p>We use modern technologies\nWe use React, ES6, gulp, Bootstrap, Less, Webpack, Babel, JSHint, ESlint, node, npm, mocha, etc., in addition to C#, IIS, ASP.NET, and Amazon Web Services. We write unit tests. We&#39;re working on the mobile strategy and exploring React Native for mobile development. </p>\n\n<p>What we&#39;ll do</p>\n\n<p>Help you grow in your career. Offer mentoring.\nProvide opportunities and let you run with them.\nEncourage normal work hours.\nHackathons every three months. Lots of fun activities.</p>\n\n<p>What you&#39;ll do</p>\n\n<p>Full-stack development with focus on the front-end.\nResearch and evangelize best practices and modern technologies.\nWork across teams and products alongside a highly functional, world-class development team.\nReport to the Web Architect.</p>\n\n<p>What you&#39;ll need</p>\n\n<p>Strong full-stack experience on a SaaS or similar site with focus on the front-end. \nFluent in technologies similar to what PayScale uses (we know great developers can work in any language).\nHave introduced at least one key technology or practice that was adopted by other engineering teams (e.g. unit testing).\nStrong desire to learn and grow. Self-motivation. Strong drive to move things forward.\nKeeping up-to-date on the latest trends and changes in the front-end community.\nBonus: mobile development experience (iOS, Android).\nClear communication skills.\n6+ years experience (or convince us otherwise).\nBS in Computer Science or equivalent.</p>\n\n<p>Some Benefits We Offer</p>\n\n<p>100% company paid medical/vision/dental/prescription premiums for employees (50% for eligible dependents and domestic partners).\nFlexible Spending Account (FSA) for transportation, medical, and dependent care.\nUnlimited paid time off, 9 paid holidays.\n401(k) with company match.\nLockers and showers.</p>\n\n<p>PayScale in located in Pioneer Square, Seattle. We can&#39;t wait to have you be a part of it.</p>\n","how_to_apply":"<p>Please apply at: <a href=\"http://www.payscale.com/about/jobs\">http://www.payscale.com/about/jobs</a></p>\n","company":"PayScale","company_url":"http://www.payscale.com/about/jobs","company_logo":"http://github-jobs.s3.amazonaws.com/5a040958-45d7-11e5-8d87-e01202dc8817.jpg","url":"http://jobs.github.com/positions/75148da8-45d7-11e5-9f48-5a75be6a63c6"},{"id":"5a30fc36-4525-11e5-83df-458f347f8fed","created_at":"Tue Aug 18 16:01:42 UTC 2015","title":"Lead Data Engineer","location":"San Francisco","type":"Full Time","description":"<p>Lead Data Engineer</p>\n\n<p>StyleSeat is the leading marketplace &amp; platform for service providers in the $78 billion beauty and wellness industry. We&#39;re continuing to experience hyper growth, and have processed over a billion dollars worth of transactions since being founded. Consumer-facing StyleSeat.com and the StyleSeat Apps are fast becoming the OpenTable/standard for beauty &amp; wellness appointments. We&#39;re well funded by blue chip investors, including: Founders Fund, Lowercase Capital, 500Startups, Lightspeed, Ashton Kutcher, Sophia Bush and the founders of Uber and Path. StyleSeat’s environment is highly agile and fast-paced, but also balanced and highly collaborative. We’re a strong Team of (40+) people, with great offices located in San Francisco&#39;s SoMa district. </p>\n\n<p>StyleSeat is a heavily data-driven company building out a core Data Engineering group after our Series B fundraise to develop initial ETL processes and build out a data warehouse that enables the product, business and data science teams to efficiently leverage the massive amount of consumer data available to us to drive our business forward.</p>\n\n<p>Qualifications:</p>\n\n<p>8+ yrs. experience developing ETL pipelines and data warehouse systems</p>\n\n<p>Experience hiring and managing a team of data engineers to build out a data warehouse system</p>\n\n<p>Experience with Redshift, Hadoop and similar data stores</p>\n\n<p>3+yrs. experience using Python</p>\n\n<p>Experience with consumer facing applications and understands consumer engagement metrics</p>\n\n<p>Experience partnering with business and product to deliver data solutions against strategic goals</p>\n\n<p>Experience with monitoring, backup, and disaster recovery of data systems</p>\n\n<p>Experience working with agile practices</p>\n\n<p>Passion towards quality engineering</p>\n\n<p>Bachelor&#39;s in Computer Science/Engineering or equivalent experience </p>\n\n<p>We offer competitive compensation, equity, medical and dental, commuter benefits, gym membership, dog friendly space and we provide lunch every day!</p>\n","how_to_apply":"<p><a href=\"http://www.jsco.re/2yta\">http://www.jsco.re/2yta</a></p>\n","company":"StyleSeat","company_url":"http://www.styleseat.com","company_logo":null,"url":"http://jobs.github.com/positions/5a30fc36-4525-11e5-83df-458f347f8fed"},{"id":"12333646-1547-11e5-9bea-95cd021bfc8b","created_at":"Tue Aug 18 14:17:03 UTC 2015","title":"Senior Javascript Engineer","location":"San Francisco","type":"Full Time","description":"<p>At CreativeLive, we are relentless in our pursuit of wonder. We believe the best work is created with equal parts imagination, discipline, and hustle. We believe play is a daily practice, and that creativity is the new literacy.</p>\n\n<p>Join our <strong>dynamic team of tinkerers hard at work building the future of education</strong>. From our offices in Seattle and San Francisco, we connect students from all walks of life with top-notch learning from industry leaders. We make it possible for people everywhere to learn what they want and do what they love.</p>\n\n<p><strong>Make real things. Stay curious. Have fun.</strong></p>\n\n<p>CreativeLive is looking for <strong>talented engineers</strong> to join our growing technical team in our San Francisco office. You will be forging a new frontier in online learning applications, leveraging and contributing to open source technology.</p>\n\n<p>Our platform is built on <strong>Node and Angular</strong>, so you will ideally have solid experience coding in Javascript, and be excited by being empowered to contribute and learn at any level of the stack, from defining clean server APIs to creating beautiful front-end experiences.</p>\n\n<p>Along with your fellow engineers, you&#39;ll be working with design and product to continuously improve the CreativeLive site and internal tools by:</p>\n\n<ul>\n<li>iterating on prototypes</li>\n<li>architecting modules and applications</li>\n<li>refactoring existing parts of the site</li>\n<li>extending our content management system</li>\n<li>implementing data visualization dashboards</li>\n<li>interfacing with (and creating) web services </li>\n<li>improving the scalability and fault tolerance of our distributed systems</li>\n<li>actively contributing to refining our Agile development processes</li>\n</ul>\n\n<p><strong>What we&#39;re looking for:</strong></p>\n\n<ul>\n<li>5+ years professional experience as a software engineer</li>\n<li>Mastery of basic Computer Science principles</li>\n<li>Strong programming skills in a variety of languages </li>\n<li>Excellent HTML/CSS skills</li>\n<li>A passion for clean and elegant code</li>\n<li>Understanding of web services</li>\n<li>A good understanding of how to create responsive websites</li>\n<li>Experience with both relational and non-relational databases, such as MongoDb, Redis, and MySQL</li>\n</ul>\n\n<p><strong>Preferred:</strong></p>\n\n<ul>\n<li>A 4-year accredited technical degree, or equivalent professional experience (not just a coding bootcamp, please)</li>\n<li>Experience writing complex applications in Javascript</li>\n<li>Familiarity with Node.js and the common frameworks and npm modules</li>\n<li>An active Github account, showcasing your own projects</li>\n</ul>\n","how_to_apply":"<p>Please apply at <a href=\"http://www.creativelive.com/jobs\">www.creativelive.com/jobs</a></p>\n","company":"CreativeLive, Inc.","company_url":"http://www.creativelive.com","company_logo":"http://github-jobs.s3.amazonaws.com/02636f60-1547-11e5-869a-7b4060c39ce1.jpg","url":"http://jobs.github.com/positions/12333646-1547-11e5-9bea-95cd021bfc8b"},{"id":"569d6cd2-4505-11e5-8fc1-a119d959a36f","created_at":"Mon Aug 17 17:28:49 UTC 2015","title":"Back-End Web Developer","location":"East Lansing, Michigan","type":"Full Time","description":"<p><p><strong><span style=\"font-size: 9.0pt; color: black;\">Back-End Web Developer</span></strong></p> <p><span style=\"font-size: 9.0pt; color: black;\"> </span></p> <p><span style=\"font-size: 9.0pt; color: black;\">Michigan State University (MSU) is seeking an innovative and creative Back-End Web Developer responsible for managing the interchange of data between the application and the browser. This role focuses on the server side of programming for the web, yet also requires understanding the programming languages that control the display of content in the browser. </span></p> <p><span style=\"font-size: 9.0pt; color: black;\"> </span></p> <p><strong><span style=\"font-size: 9.0pt; color: black;\">Responsibilities</span></strong></p> <p><span style=\"font-size: 9.0pt; color: black;\">The Back-End Web Developer:</span></p> <ul> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Integrates user-facing elements developed by front-end developers with server-side logic</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Develops and modifies object-oriented frameworks both inside and outside of a CMS</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Builds reusable code and libraries</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Develops front-end code that meets or exceeds WCAG 2.0 AA and W3C web standards </span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Develops applications that interface with web services</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Implements security and data protection</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Provides detailed estimates of time and resources required to meet project objectives</span></li> </ul> <p><strong><span style=\"font-size: 9.0pt; color: black;\"> </span></strong></p> <p><strong><span style=\"font-size: 9.0pt; color: black;\">Qualifications</span></strong></p> <p><span style=\"font-size: 9.0pt; color: black;\">Candidates should have:</span></p> <ul> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">A Bachelor’s degree in computer science, information systems, business, or related information technology field, with course work in an information technology specialization related to robust content management solutions and integrating databases/APIs and related back-end systems, or an equivalent combination of education and experience</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">At least three years of related and progressively more responsible or expansive work-related knowledge of PHP, HTML, XML, JSON, and CSS</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Experience writing regular expressions and database queries</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Demonstrated knowledge and use of web-accessibility fundamentals </span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Experience in scripting development best practices, architecture, scalability, etc.</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Demonstrated success executing tasks with both procedural and OOP development techniques</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">OWASP-based knowledge in best practices for securing web applications</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Experience using version control like Git and CSS preprocessors such as LESS or SASS</span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">High level of verbal and written communication skills </span></li> <li><span style=\"font-size: 9.0pt; font-family: Cambria; color: black;\">Previous employment with a corporation or agency as a back-end web developer</span></li> </ul> <p><span style=\"font-size: 9.0pt; color: black;\"> </span></p> <p><strong><span style=\"font-size: 9.0pt; color: black;\">Learn More or Apply</span></strong></p> <p><span style=\"font-size: 9.0pt; color: black;\">To learn more about this opportunity, visit <strong>cabs.msu.edu/careers/back-end-web-developer</strong>. </span></p> <p><span style=\"font-size: 9.0pt; color: black;\"> </span></p> <p><span style=\"font-size: 9.0pt; color: black;\">To assure full consideration, please apply online at </span><a href=\"http://jobs.msu.edu/\"><strong><span style=\"font-size: 9.0pt; color: black;\">jobs.msu.edu</span></strong></a><span style=\"font-size: 9.0pt; color: black;\"> (posting #<strong>1702</strong>) by August 18. Applications must include a letter of application, résumé, and contact information for three references.</span></p> <p><span style=\"font-size: 9.0pt; color: black;\"> </span></p> <p><strong><span style=\"font-size: 9.0pt; color: black;\">About MSU/East Lansing</span></strong></p> <p><span style=\"font-size: 9.0pt; color: black;\">Michigan State University is situated on a beautiful, park-like campus, close to major metropolitan centers, with outlying research facilities and natural areas and a proud land-grant heritage. The campus is located in East Lansing and adjacent to the capital city of Lansing, with a diverse population of approximately 450,000. Local communities have excellent school systems and place a high value on education. The campus has nearly 5,500 faculty and academic staff, more than 6,300 support staff, and more than 50,000 students. MSU is an equal-opportunity employer committed to supporting and actively increasing diversity in all areas of campus. MSU is proactive in exploring opportunities for employment of dual-career couples, both inside and outside the university. Information about MSU’s dual-career support can be found at </span><a href=\"http://miwin.msu.edu\"><strong><span style=\"font-size: 9.0pt; color: black;\"><a href=\"http://miwin.msu.edu\">http://miwin.msu.edu</a></span></strong></a><span style=\"font-size: 9.0pt; color: black;\">. </span></p> <p><span style=\"font-size: 9.0pt; color: black;\"> </span></p> <p><em><span style=\"font-size: 9.0pt; color: black;\">MSU is an affirmative action, equal opportunity employer. MSU is committed to achieving excellence through a diverse workforce and inclusive culture that encourages all people to reach their full potential. The university actively encourages applications and/or nominations of women, persons of color, veterans, and persons with disabilities.</span></em></p><br/><br/><a href=\"http://www.Click2Apply.net/zdkk2kg2d5\">Apply Here</a><br/><br/> <img class=\"img\" src=\"https://rs.careerliaison.com/pixel/zdkk2kg2d5\"><img class=\"img\" src=\"https://analytics.click2apply.net/vk4nk8xHaorlzigZzsJ1VrSD\"><style>img.img { width: 0px !important;}</style></p>\n","how_to_apply":"<p>Apply Online</p>\n","company":"Michigan State University","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/569d6cd2-4505-11e5-8fc1-a119d959a36f"},{"id":"954b85be-5a97-11e2-9200-db7eecfdb6d8","created_at":"Thu Aug 13 20:03:06 UTC 2015","title":"Software Engineer - Infrastructure","location":"San Francisco, CA","type":"Full Time","description":"<p><em>About the teams:</em></p>\n\n<p>Yelp&#39;s Search &amp; Data Mining, Ads, and Spam Prevention teams run services that respond to hundreds of requests every second. Each and every query must be lightning fast, 24/7/365. This means our infrastructure needs to be both speedy and reliable. It also needs to make efficient use of resources and be easy to use for relevance/machine learning developers to modify and improve.</p>\n\n<p>Your core responsibility will be helping to define and build that long-term vision of a fast, reliable, efficient, and ductile search infrastructure. So get your infra mojo on and join us!</p>\n\n<p><em>Things we like:</em></p>\n\n<ul>\n<li>Prior experience with production large-scale distributed systems.</li>\n<li>Demonstrated ability to work with a large amount of independence and responsibility.</li>\n<li>Ability to work closely with information retrieval/machine learning experts on big-data problems. Some interest and familiarity with IR/ML is a plus, but it will not be your primary focus.</li>\n<li>Prior experience with Lucene, ElasticSearch, Hadoop/mrjob, or large data stores (MySQL or NoSQL - we just want the right solution for the situation).</li>\n<li>A hunger for tracking down root causes -- no matter how deep it takes you -- and fixing them in systematic ways.</li>\n<li>We use Java &amp; Python. You don’t need to be an expert, but experience is a plus and we will expect you to learn them on the job.</li>\n<li>Minimum BA/BS degree in Computer Science, Math, or related degree</li>\n<li>A sense of humor and excellent aim with Nerf darts.</li>\n</ul>\n","how_to_apply":"<p><a href=\"https://jobs.lever.co/yelp/53198a94-0808-491b-83cd-18c6eb6dc27a?lever-source=Github\">Apply here</a></p>\n","company":"Yelp","company_url":"http://www.yelp.com/","company_logo":"http://github-jobs.s3.amazonaws.com/918c8f72-5a97-11e2-9d91-411f41c4da39.jpg","url":"http://jobs.github.com/positions/954b85be-5a97-11e2-9200-db7eecfdb6d8"},{"id":"826937b2-41f2-11e5-8121-8c8d5ced5cad","created_at":"Thu Aug 13 19:36:28 UTC 2015","title":"Siri Hadoop Operations Engineer - 39915740","location":"Cupertino, CA","type":"Full Time","description":"<p>Changing the world is all in a day&#39;s work at Apple. If you love innovation, here&#39;s your chance to make a career of it. You&#39;ll work hard. But the job comes with more than a few perks.<br><br><p>Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, big data, and artificial intelligence. And work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. <br /><br />Join the Siri team at Apple. Apple’s Siri team is looking for talented Engineers to help design, develop, and support their large scale infrastructure based on Hadoop. The ideal candidate is passionate about open source technologies with a track record of contribution. We are looking for a candidate who is focused on furthering Hadoop technologies at Apple. Candidates will be working closely with not only the Siri Operations team but also with Siri platform development. It is crucial that this individual works well with others, as the Siri team is a strong, collaborative, and dynamic\norganization.<br /></p><p>Key Qualifications:<br />•Deep understanding of the Hadoop ecosystem (Zookeeper, Solr, Spark, HBase, HDFS, Flume, Map Reduce)<br />•Strong knowledge with object-oriented programming languages (Java)<br />•Strong knowledge of the Linux operating system<br />•Fluent in at least one scripting language (Shell, Python, Ruby, etc.)<br />•Strong verbal and written skills<br />•Team oriented individual who can work well with others<br /></p><p>Description:<br />- Operate one of the largest Hadoop clusters which supports the development and analytics of Siri <br />- Troubleshoot Hadoop related application and infrastructure issues at scale <br />- Participate in the development and deployment of tools to help Siri engineers perform their jobs more effectively and efficiently <br />- Contribute to the development of Hadoop related technologies <br />- Lead automation efforts to streamline the management of Hadoop infrastructure <br />- Provide\ndirection to other Apple teams on how to leverage open source technologies<br /><br /></p><p>Education:<br />B.S. degree in Computer Science or 3 + years of programming experience or equivalent.<br /></p><p>Additional Requirements:<br />- Mesos infrastructures <br />- JVM performance optimizations <br />- SGE experience a plus<br /></p>\nApple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=1ec37251eaf7e4109e391143663c33ed\"><img border=\"0\" alt=\"Apply\" src=\"http://www2.equest.com/images/applyhere.gif\"/></a> <img src=\"https://ars2.equest.com/?response_id=1ec37251eaf7e4109e391143663c33ed&view\" alt=\" \" width=\"1\" height=\"1\"/></p>\n","company":"Apple Inc.","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/826937b2-41f2-11e5-8121-8c8d5ced5cad"},{"id":"329c72b2-41f2-11e5-9835-83ed0cb90470","created_at":"Thu Aug 13 19:34:39 UTC 2015","title":"Siri QA Server Engineer - 35880017","location":"Cupertino, CA","type":"Full Time","description":"<p>Changing the world is all in a day&#39;s work at Apple. If you love innovation, here&#39;s your chance to make a career of it. You&#39;ll work hard. But the job comes with more than a few perks.<br><br><p>Play a part in ensuring the quality of groundbreaking technology for large scale systems, natural language, big data, and artificial intelligence. You will be interacting with various teams of cross functional engineering and project management to help identify issues, test features and drive the quality of the Siri user experience. Work with the people who created the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri QA team at Apple.<br /></p><p>Key Qualifications:<br />•Must have 3 years professional work experience<br />•Degree or working experience in software engineering<br />•Strong organizational skills and experience working on large cross functional teams<br />•Self-motivated and pro-active with demonstrated creative and critical thinking capabilities<br />•Flexibility to respond and react to a rapidly evolving software environment<br />•Familiar with iOS, Mac OS X, debugging tools and Terminal<br\n/>•Experience with Java, C++, Perl, Python, Bash<br />•Experience working with large scale server software features<br /></p><p>Description:<br />Contributing to server-side test automation efforts<br />Enhance and build tools as needed for server testing<br />Feature scoping and test plan engineering<br />Finding, debugging, and reporting of software bugs<br />Escalating key quality issues and driving to resolution<br /><br /></p><p>Education:<br />MS/BS in Computer Science or equivalent experience<br /></p>\nApple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=cb4f495493ab1679922d4cc43c833b18\"><img border=\"0\" alt=\"Apply\" src=\"http://www2.equest.com/images/applyhere.gif\"/></a> <img src=\"https://ars2.equest.com/?response_id=cb4f495493ab1679922d4cc43c833b18&view\" alt=\" \" width=\"1\" height=\"1\"/></p>\n","company":"Apple Inc.","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/329c72b2-41f2-11e5-9835-83ed0cb90470"},{"id":"bfd98e18-41f1-11e5-92ed-62b7b4bac3dd","created_at":"Thu Aug 13 19:30:59 UTC 2015","title":"Senior Manager - Data Test Engineering - 38790203","location":"Cupertino, CA","type":"Full Time","description":"<p>Changing the world is all in a day&#39;s work at Apple. If you love innovation, here&#39;s your chance to make a career of it. You&#39;ll work hard. But the job comes with more than a few perks.<br><br><p>We are looking for a experienced manager of managers with a track record of scaling engineering organizations that test data and data pipelines. You will be expected to provide clear measurements of data and service quality. You must be highly communicative, a good facilitator, and a strong leader. <br /></p><p>Key Qualifications:<br />•7 years of engineering management experience including scaling a large organization while delivering on an aggressive roadmap<br />•Experience in a test or QA Manager role owning release decisions, scoping work, and driving bug convergence<br />•Track record of attracting, retaining, and growing people to create a self organized and highly empowered team<br />•Ability to motivate people, instill accountability, and achieve results<br />•Experience creating and leveraging qualitative metrics and measurements<br />•Strong verbal and written communication skills, impeccable organizational and time management skills<br />•Able to work in an ambiguous and highly interdependent work environment to get things done in an efficient and tactful way<br />•Track record of building strong working relationships across a large organization<br /></p><p>Description:<br />In this role you will lead our data and pipeline test engineering teams.  You will be responsible for data quality as well as the services used to conflate, edit, and publish the data. You will be expected to rapidly grow your organization to keep pace with ambitious goals. <br /><br />Maps Test Engineering tests highly complex systems and we need an experienced engineering manager that can work to understand requirements cross-functionally and ensure we deliver better features faster with great quality. You thrive in a fast paced environment and can adapt quickly. You’re equally happy diving deep into a technology area as you are providing guidance and process to get teams pointed in the right direction. <br /></p><p>Education:<br />BS or MS\nin Computer Science or equivalent industry experience<br /></p>\nApple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=908e029d3ac072d75d2a92d91f4fefe3\"><img border=\"0\" alt=\"Apply\" src=\"http://www2.equest.com/images/applyhere.gif\"/></a> <img src=\"https://ars2.equest.com/?response_id=908e029d3ac072d75d2a92d91f4fefe3&view\" alt=\" \" width=\"1\" height=\"1\"/></p>\n","company":"Apple Inc.","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/bfd98e18-41f1-11e5-92ed-62b7b4bac3dd"},{"id":"88e24fb2-41f1-11e5-918c-a510ff963a48","created_at":"Thu Aug 13 19:29:32 UTC 2015","title":"iTunes Store - Ruby Developer - 40026964","location":"Cupertino, CA","type":"Full Time","description":"<p>Changing the world is all in a day&#39;s work at Apple. If you love innovation, here&#39;s your chance to make a career of it. You&#39;ll work hard. But the job comes with more than a few perks.<br><br><p>The iTunes Evaluation team is looking for a top-notch engineer to build and enhance our algorithmic quality evaluation tools.<br /></p><p>Key Qualifications:<br />•Proficiency in Ruby on Rails, NoSQL, background processing, JavaScript, CSS and front end development.<br />•Ability to use web standards to build solutions<br />•Keep technically abreast of changes, advancements, and/or improvements and incorporate these improvements where applicable.<br />•Understanding of large-scale applications, data modeling, data visualization and data analysis<br />•Excellent debugging, analytical, problem solving, and communication skills<br /></p><p>Description:<br />In this role, you&#39;ll be building user interfaces to visualize and interact with large iTunes content data sets, and build cross functional solutions and leverage them to improve the iTunes Store. You&#39;ll work with engineers, product teams, and researchers at many layers of the analytics stack, to collect,\nvisualize, and present results to a wide audience.<br /></p><p>Education:<br />BS / BA degree in Computer Science or equivalent.<br /></p><p>Additional Requirements:<br />5+ years of experience working in UI and Web engineering.<br />Previous experience with search, web, or mobile analytics is a plus.<br /></p>\nApple is an Equal Employment Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities.</p>\n","how_to_apply":"<p><a href=\"https://ars2.equest.com/?response_id=b2bde10ec0f93460d2546dd859bab630\"><img border=\"0\" alt=\"Apply\" src=\"http://www2.equest.com/images/applyhere.gif\"/></a> <img src=\"https://ars2.equest.com/?response_id=b2bde10ec0f93460d2546dd859bab630&view\" alt=\" \" width=\"1\" height=\"1\"/></p>\n","company":"Apple Inc.","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/88e24fb2-41f1-11e5-918c-a510ff963a48"},{"id":"b853a074-5a7d-11e2-9d67-f6e5a9eda78c","created_at":"Thu Aug 13 16:57:58 UTC 2015","title":"Software Engineer - Data-Mining","location":"San Francisco, CA","type":"Full Time","description":"<p><em>About the teams:</em></p>\n\n<p>Our Search &amp; Data Mining, Ads and Spam Prevention teams see 47M+ Yelp reviews and 117M+ monthly unique visitors as one giant playground for data mining. They banter about Bandits, know their way down a Gradient, and aren’t too Naïve to kick back in our Bay(es) Area offices. We love new ideas and collaboration: don’t come here with any Prior prejudices or you will Maximize your Likelihood of getting your Posterior kicked.</p>\n\n<p>Our mission: to make Yelp psychic. When you want cheap thai delivery for dinner, your wish is our code. Looking for a memorable night out? An ad for the best local flower shop might be just the tip you need to make the night unforgettable.</p>\n\n<p>Our teams eat data for breakfast, chew it up, and spit out useful products. Saddle up and get on board!</p>\n\n<p><em>You will...</em></p>\n\n<ul>\n<li>Work with the team to come up with creative ideas for new products and signals, then carry those ideas all the way to launch.</li>\n<li>Explore data to measure the impact of your changes and come up with ideas for how to maximize that impact.</li>\n<li>Work closely with infrastructure engineers to make sure that your algorithms will effectively scale to large data sets and to ensure that their systems provide the flexibility needed for your ideas.</li>\n</ul>\n\n<p><em>You should have...</em></p>\n\n<ul>\n<li>A passion for big data, and creative ideas for what to do with it.</li>\n<li>The algorithms and data structures experience to make your ideas workable.</li>\n<li>The coding experience to turn those ideas into reality. We use Java &amp; Python. You don’t need to be an expert, but experience is a plus and we will expect you to learn them on the job.</li>\n<li>A background in Machine Learning or Information Retrieval.</li>\n<li>Minimum BA/BS degree in Computer Science, Math, or related degree</li>\n<li>A love of delighting people with local knowledge.</li>\n</ul>\n\n<p><em>Pluses...</em></p>\n\n<ul>\n<li>Experience working with ElasticSearch, Lucene, Hadoop, or mrjob</li>\n<li>Experience applying Auction theory, CTR prediction, Game theory, Graph theory, Natural language processing, Recommender systems, Spam detection, Stochastic optimization</li>\n</ul>\n","how_to_apply":"<p><a href=\"https://jobs.lever.co/yelp/b1e85806-9f1e-433a-9080-69b821face9c?lever-source=Github\">Apply here</a></p>\n","company":"Yelp","company_url":"http://www.yelp.com/","company_logo":"http://github-jobs.s3.amazonaws.com/af220d9c-5a7d-11e2-80ad-ff910efcf650.jpg","url":"http://jobs.github.com/positions/b853a074-5a7d-11e2-9d67-f6e5a9eda78c"},{"id":"0bf2c268-bd29-11e4-9c92-f8606979f4a3","created_at":"Tue Aug 11 20:01:11 UTC 2015","title":"Big Data Engineer (Java)","location":"Waltham, MA","type":"Full Time","description":"<p>Role \nThe mission of Amadeus’ Hotel IT team is to design and deliver high performance systems that can process tens of thousands of requests per second and return the highest level of accuracy in the fastest response time. Our SaaS platforms are designed to serve millions of users who are seeking information and reservations from tens of thousands of hotels offering millions of hotel rooms around the world. Utilizing our proven ability to build and deploy mission critical software for the global travel industry, we are creating the next generation of technology solutions for the hospitality industry including: reservations and distribution, high-volume data acquisition from heterogeneous sources, sophisticated search engines, payment processing, hotel operations, business intelligence, and revenue management.</p>\n\n<p>The aim of the Hotel Reporting and Business Intelligence team is to provide high volume real-time operational reporting on large systems and novel and revolutionary insights to the hotel industry. We help our customers be become better run and more profitable by improving their level of knowledge about their own businesses and providing actionable data.</p>\n\n<p>The Java Engineer for Reporting and Business Intelligence is an expert on building high availability, high transaction JEE web applications.  </p>\n\n<p>Responsibilities</p>\n\n<ul>\n<li>Build web service oriented web applications to capture, analyze, publish and display data</li>\n<li>Create ETLs to feed the data warehouse </li>\n<li>Create reporting services \nQualifications and Education Requirements</li>\n<li>B.S. or M.S. in Computer Science, Engineering, Mathematics or equivalent experience.</li>\n<li>Demonstrated experience working with high availability service oriented applications </li>\n<li>5+ years experience in Java/JEE web development (JBoss, Weblogic, etc.)</li>\n<li>Strong knowledge of  SQL (Oracle, MySQL, SQL Server) databases\nPreferred Skills</li>\n<li>Experience with frontend web development (HTML, CSS, JavaScript, AngularJS/Ember.js)</li>\n<li>Knowledge of NoSQL (Couchbase, MongoDB)</li>\n<li>Experience with Hadoop (Hive, Pig, Spark, HBase, Impala)</li>\n<li>Experience with Business Intelligence tools (Oracle BI, SSRS) and/or Reporting Tools (JasperReports) a plus</li>\n<li>Experience with stream processing (Kafka, Storm) a plus</li>\n</ul>\n\n<p>Amadeus strives to achieve outstanding results through a diverse workforce. Our employees represent over 123 nationalities. We welcome and embrace individual differences to bring out the brilliance in ourselves, our customers and each other. We are proud to be an equal opportunity employer.</p>\n","how_to_apply":"<p><a href=\"https://career012.successfactors.eu/sfcareer/jobreqcareer?jobId=20001&amp;company=AmadeusProd&amp;username=\">Apply here</a></p>\n","company":"Amadeus","company_url":"http://www.amadeus.com/","company_logo":"http://github-jobs.s3.amazonaws.com/08a25f1a-bd29-11e4-9850-2164e355eba2.jpg","url":"http://jobs.github.com/positions/0bf2c268-bd29-11e4-9c92-f8606979f4a3"},{"id":"82e9ef34-f80e-11e4-8c34-97af1bf4e622","created_at":"Tue Aug 11 18:49:53 UTC 2015","title":"Software Engineer- C++ (Hotel IT)","location":"Waltham, MA","type":"Full Time","description":"<p>Shaping the future of travel is important to us at Amadeus. Today, with technology getting smarter by the minute, that future is more exciting than ever.</p>\n\n<p>Our business success relies on our people being always passionate about what we do. We believe in aiming for excellence, taking responsibility, working together and putting our customers first.<br>\nWe are seeking today’s leaders who can move toward greater responsibility and results. We also offer internships to college and university students who want to grow and learn from some of the industry’s best experts. Discover how you can shape the future of travel with us.</p>\n\n<p>The mission of Amadeus’ Hotel IT team is to design and deliver high performance systems that can process tens of thousands of requests per second and return the highest level of accuracy in the fastest response time. Our SaaS platforms are designed to serve millions of users who are seeking information and reservations from tens of thousands of hotels offering millions of hotel rooms around the world. Utilizing our proven ability to build and deploy mission critical software for the global travel industry, we are creating the next generation of technology solutions for the hospitality industry including: reservations and distribution, high-volume data acquisition from heterogeneous sources, sophisticated search engines, payment processing, hotel operations, business intelligence, and revenue management.</p>\n\n<p>Responsibilities:\nThe Amadeus Hotel platform is an SOA solution delivering a fully centralized reservation system for large hotel chains. New customer needs will require evolution of the platform. Two types of technology are deployed: C++ for the open back end in charge of the core functionality and Java for the portal in charge of the platform administration.\nWe are looking for several Software Developers in C++ to join the team and participate in these efforts! </p>\n\n<ul>\n<li>Design, code, test, debug, document and maintain software solutions.</li>\n<li>Design technical solutions and perform feasibility studies.</li>\n<li>Propose viable technical solutions to Product Management and/or users for validation.</li>\n<li>Model, design and implement databases as necessary.</li>\n<li>Develop software according to Amadeus Standards.</li>\n<li>Conduct unit, package and performance tests of the software and ensure a level of quality in line with the Amadeus guidelines.</li>\n<li>Participate in the validation / acceptance phase of the product cycle ensuring the fine-tuning necessary to finalise the product.</li>\n<li>Produce software documentation necessary for the application and issue it to the requesting departments.</li>\n<li>Support the end user in the Production phase by debugging existing software solutions in response to Problem Tracking Records (PTR) and Change Requests (CR) issued from Product Management or Product Definition.\nQualifications:</li>\n<li>Bachelor&#39;s degree in Computer Science or related field, or equivalent.</li>\n<li>1+ years experience developing software in a UNIX environment.</li>\n<li>Technical skills with the following: C++, UML, SQL/RDBMS.</li>\n<li>Strong team player with collaborative mindset; agile experience preferred.</li>\n<li>Comfortable in a multi-cultural, international organization.</li>\n<li>Hotel IT knowledge, GDS distribution models knowledge, and Air IT knowledge are a plus.</li>\n<li>Relocation Assistance is available.</li>\n</ul>\n\n<p>Please apply: <a href=\"https://career012.successfactors.eu/career?company=AmadeusProd&amp;career_ns=job_listing&amp;navBarLevel=JOB_SEARCH&amp;career_job_req_id=20582\">https://career012.successfactors.eu/career?company=AmadeusProd&amp;career_ns=job_listing&amp;navBarLevel=JOB_SEARCH&amp;career_job_req_id=20582</a></p>\n","how_to_apply":"<p><a href=\"https://career012.successfactors.eu/career?company=AmadeusProd&amp;career_ns=job_listing&amp;navBarLevel=JOB_SEARCH&amp;career_job_req_id=20582\">Apply here</a></p>\n","company":"Amadeus","company_url":"http://www.amadeus.com/","company_logo":"http://github-jobs.s3.amazonaws.com/5cd30894-f80e-11e4-9a72-e8cc6f7f5b4a.jpg","url":"http://jobs.github.com/positions/82e9ef34-f80e-11e4-8c34-97af1bf4e622"},{"id":"83ec80e6-f803-11e4-98db-b98aa8cc17aa","created_at":"Tue Aug 11 17:31:10 UTC 2015","title":"Python Engineer - Hotel Business Intelligence","location":"Waltham, MA","type":"Full Time","description":"<p>Have you thought about a new adventure? How about Boston?</p>\n\n<p>As a company that is passionate about travel and adventure, we attract employees who relish travel and adventure as well. How would you feel about moving to Boston to work at a state-of-the-art facility with some of the best minds in software? Boston offers a rich history, fantastic educational institutions, a beautiful seacoast and some of the brightest, kindest people you could ever hope to meet. Oh, and our sports teams just keep winning. We offer very generous relocation, and will take care of you each step of the way to make sure your move is smooth and painless.</p>\n\n<p>Why this is a great role:</p>\n\n<p>The Amadeus Hotel Platform is the heart of a hotel chain&#39;s business. It serves as the central point of pricing, configuration, and booking for every hotel in a chain. The system maintains thousands of hotel configurations, millions of pricing rules, and hundreds of millions of hotel reservations at any given time. Whenever any of this data is created or modified, the Amadeus Hotel Platform must synchronize with the rest of the hotel infrastructure.</p>\n\n<p>The Data Integrity and Publication team is responsible for guaranteeing that the data in the Amadeus Hotel Platform is synchronized to the rest of the ecosystem with a very high level of reliability and transaction volume. The team has complete responsibility from defining the APIs, to creation of the publication feeds, to managing the guarantee of delivery and production monitoring. The system is able to publish thousands of individual events per second at peak.</p>\n\n<p>The Python Engineer for Data Integrity and Publication the glue that holds the publication system together. They are responsible for implementing the business logic that allows system to run at peak performance and stay in touch with the rest of the hotel ecosystem.\nWe work in SCRUM, and are looking for smart, flexible thinkers who can understand the business of our customers as well as produce the code that powers our products. We are interested in candidates that are looking to work in a highly collaborative environment with a team drawn from around the world.</p>\n\n<p>What you will be doing:</p>\n\n<ul>\n<li>Create and architect a Python based API for managing all Hotel Platform data across the hotel ecosystem</li>\n<li>Help build our hotel data repository to be used for BI, Revenue Management, Reporting, Customer Analytics, and Pricing</li>\n</ul>\n\n<p>What we would like to see (but we&#39;re flexible, and we teach smart people):</p>\n\n<ul>\n<li>B.S. or M.S. in Computer Science, Engineering, Mathematics or equivalent experience.</li>\n<li>Demonstrated experience working with server to server solutions</li>\n<li>2+ years experience in Python</li>\n<li>Good knowledge of SQL (Oracle, MySQL, SQL Server) databases</li>\n<li>Familiarity with UNIX/Linux environments</li>\n<li>Experience in other languages such as Java or C++</li>\n<li>Experience with enterprise web development (e.g. JBoss, Weblogic, etc.)</li>\n<li>Familiarity with UML including sequence diagrams</li>\n<li>Knowledge of NoSQL (Couchbase, MongoDB)</li>\n<li>Experience with Hadoop (Hive, Pig, Spark, HBase, Impala)</li>\n</ul>\n\n<p>Who we are:</p>\n\n<p>Amadeus is the leading provider of IT solutions to the global tourism and travel industry. We are one of the ten largest e-commerce companies in the world.  As a leading transaction processor and provider of advanced technology solutions for the global travel and tourism industry, we process over 2B transactions a day!</p>\n\n<p><a href=\"https://career012.successfactors.eu/career?company=AmadeusProd&amp;career_ns=job_listing&amp;navBarLevel=JOB_SEARCH&amp;career_job_req_id=24282\">https://career012.successfactors.eu/career?company=AmadeusProd&amp;career_ns=job_listing&amp;navBarLevel=JOB_SEARCH&amp;career_job_req_id=24282</a></p>\n\n<p>Amadeus strives to achieve outstanding results through a diverse workforce. Our employees represent over 123 nationalities. We welcome and embrace individual differences to bring out the brilliance in ourselves, our customers and each other. We are proud to be an equal opportunity employer.</p>\n","how_to_apply":"<p><a href=\"https://career012.successfactors.eu/career?company=AmadeusProd&amp;career_ns=job_listing&amp;navBarLevel=JOB_SEARCH&amp;career_job_req_id=24282\">Apply here</a></p>\n","company":"Amadeus","company_url":"http://www.amadeus.com/","company_logo":"http://github-jobs.s3.amazonaws.com/797230b6-f803-11e4-812f-1e709a7f8b65.jpg","url":"http://jobs.github.com/positions/83ec80e6-f803-11e4-98db-b98aa8cc17aa"},{"id":"8d71961e-f98a-11e4-84fa-509f8d6c0758","created_at":"Tue Aug 11 16:10:20 UTC 2015","title":"Software Engineer - C++ (Airline Ticketing & Fulfillment Technology)","location":"Waltham, MA","type":"Full Time","description":"<p>Join us and shape the future of travel\nShaping the future of travel has always been important to us at Amadeus. Today, with technology getting smarter by the minute, that future is more exciting than ever.\nWe work at the heart of the global travel industry. Amadeus offers you the opportunity to learn and grow and drive your own progression in an exciting and multicultural environment.\nOur people are driven by a passion for &#39;Where next?&#39; If you want to shape your career and the future of travel, Amadeus is the place for you.</p>\n\n<p>Summary of the role</p>\n\n<p>The mission of Amadeus’ AIR-DTF team is to design and deliver the high performance systems that compose the architectural, transactional, and services core of our technology. Our systems are the backbone of our PaaS offering, processing tens of thousands of ticketing requests per second. Ticketing is a complex system of technology, used by various distribution channels, and executed via many types of devices (mobile, kiosk, internet). The ticketing chain begins with the traveler experience during shopping and culminates when the flight is flown and the financial settlement is secured. The domain includes: fares and regulatory elements (e.g. taxes, fees, commissions), secure payment execution (e.g. credit card, settlement agencies, electronic wallet), issuance of electronic sales documents, and revenue accounting.</p>\n\n<p>Main responsibilities\nWe are looking for talented Software Engineers to join Amadeus&#39; R&amp;D Team. Our engineers have world-wide interaction with all of our development centers and will be responsible for the following areas:</p>\n\n<ul>\n<li>Software design, documentation, development, implementation and unit test of software modules for new functionality and enhancements </li>\n<li>Architecture design, innovation, technology forecasting </li>\n<li>Performance analysis, optimization, delivery of quality software </li>\n<li>Hardware capacity analysis </li>\n<li>Other related duties as required. </li>\n</ul>\n\n<p>Requirements</p>\n\n<ul>\n<li>Bachelor&#39;s in Computer Science or related technical discipline (or equivalent). Master&#39;s preferred. </li>\n<li>3-8 years of software design and development experience, with large knowledge of Unix/Linux. </li>\n<li>Strong competencies in data structures, in distributed computing and data storage. </li>\n<li>Extensive programming experience in C/C++, coding skills in Python is a plus. </li>\n<li>Ability to manage multiple tasks simultaneously, identify, resolve project issues quickly and effectively within a fast-paced environment. </li>\n<li>Good communication skills. </li>\n<li>Enthusiasm and experience for problem solving both independently and in team settings. </li>\n<li>Maintaining a proactive attitude in difficult and stressful situations. </li>\n<li>Driven by high quality of software. </li>\n</ul>\n\n<p>Relocation assistance available</p>\n\n<p>Amadeus strives to achieve outstanding results through a diverse workforce. Our employees represent over 123 nationalities. We welcome and embrace individual differences to bring out the brilliance in ourselves, our customers and each other. We are proud to be an equal opportunity employer.</p>\n","how_to_apply":"<p><a href=\"https://career012.successfactors.eu/sfcareer/jobreqcareer?jobId=24042&amp;company=AmadeusProd&amp;username=\">Apply here</a></p>\n","company":"Amadeus","company_url":"http://www.amadeus.com/","company_logo":"http://github-jobs.s3.amazonaws.com/87e80070-f98a-11e4-938a-9f933fb62211.jpg","url":"http://jobs.github.com/positions/8d71961e-f98a-11e4-84fa-509f8d6c0758"},{"id":"2072466a-3fb4-11e5-8826-d8e2ed7b7ae7","created_at":"Mon Aug 10 23:04:53 UTC 2015","title":"Quality Software Tester","location":"Folsom, CA","type":"Full Time","description":"<p>Panduit’s software team in Folsom, CA, develops next-generation technologies that view data centers as a system to be optimized to save energy and run robustly. We&#39;re looking for a range of test engineers who bring fresh ideas from all areas, including general software testing, test automation and scripting, wired and wireless device communication technologies and protocols, distributed system testing; the list goes on and is always growing.</p>\n\n<p>As a quality software tester, you will be a member of a dynamic development team where you will apply your system testing skills on commercially released products critical to Panduit’s corporate vision.  You will have opportunities to switch focus between test planning and execution, test automation infrastructure, UI testing, service and device testing, and other areas of expertise on the team as you and our products grow and evolve. We need our engineers to be versatile, self-motivating, display leadership qualities and be enthusiastic to tackle new problems across the full-stack as we continue to push technology forward.</p>\n\n<p>Minimum Qualifications</p>\n\n<p>BS degree in Computer Science, Electrical/Computer Engineering, similar technical field of study or equivalent practical experience\n2+ years of relevant experience\nFamiliar with testing within Agile methodologies\nFamiliar with software testing and integration concepts (defect reporting/triaging, verification/validation, end-to-end system testing, system test planning)\nFamiliar with Java and Java based applications\nKnowledgeable with scripting and general programming concepts\nAbility to create test plans and test cases and understands the importance of good documentation and traceability\nSelf-motivated but self-aware to know when to ask for assistance without delay\nPreferred Qualifications</p>\n\n<p>Experience with automation frameworks and implementing automation strategy\nExperience with or interest and ability to learn about DCIM, controls, distributed/embedded systems, or environmental device sensors\nUnderstanding of communication protocols:  TCP/IP, 802.15.4, SNMP, Modbus, or BACNet</p>\n\n<p>Panduit is a world-class developer and provider of leading-edge solutions that help customers optimize the physical infrastructure through simplification, agility, and operational efficiency. Panduit’s Unified Physical Infrastructure (UPI) based solutions give enterprises the capabilities to connect, manage and automate communications, computing, power, control and security systems for a smarter, unified business foundation. Strong relationships with technology leaders complemented with its global staff and unmatched service and support, make Panduit a valuable and trusted partner.</p>\n\n<p>In addition to going to Panduit.com website and looking at our Solutions site (<a href=\"http://www.panduit.com/Solutions/SolutionsOverview/index.htm\">http://www.panduit.com/Solutions/SolutionsOverview/index.htm</a>), please also note that Panduit was recently named by Information Week as one of the Top 500 Innovators.</p>\n","how_to_apply":"<p>Apply using the following link:\n<a href=\"https://hiring.accolo.com/jobs/Folsom/California/Quality_Software_Tester/377492768/job.htm\">https://hiring.accolo.com/jobs/Folsom/California/Quality_Software_Tester/377492768/job.htm</a></p>\n","company":"Panduit","company_url":"http://www.panduit.com","company_logo":"http://github-jobs.s3.amazonaws.com/1db1f6e6-3fb4-11e5-95e9-21bcf8e59bc0.jpg","url":"http://jobs.github.com/positions/2072466a-3fb4-11e5-8826-d8e2ed7b7ae7"},{"id":"c5b82424-3fb3-11e5-9e7b-3559b0035d4b","created_at":"Mon Aug 10 23:02:41 UTC 2015","title":"Software Engineer","location":"Folsom, CA","type":"Full Time","description":"<p>Panduit’s software team in Folsom, CA, develops next-generation technologies that view data centers as a system to be optimized to save energy and run reliably. We&#39;re looking for a range of junior to senior level engineers who bring fresh ideas from all areas, including UI design, data storage and retrieval, third-party device communication and control, distributed computing, large-scale system design, security, enterprise scalability, functional programming; the list goes on and is always growing. As a software engineer, you will be a member of a dynamic development team where you will apply your software engineering skills on commercially released products critical to Panduit’s corporate vision with opportunities to switch focus to other components of the system as you and our products grow and evolve. We need our engineers to be versatile, self-motivating, display leadership qualities and be enthusiastic to tackle new problems across the full stack as we continue to push technology forward.</p>\n\n<p>Minimum Qualifications</p>\n\n<p>BS degree in Computer Science, similar technical field of study or equivalent practical experience\n2+ years of relevant experience; 8+ years of relevant experience for senior positions\nSoftware development experience in one or more general purpose programming languages including but not limited to Java, C/C++, C#, Objective C, Python, Javascript, Erlang (or any functional language).\nInterest and ability to quickly learn Java, Javascript or Erlang if those are not your strengths\nExpertise in at least one of the following areas, with the interest and ability to learn others: web application design and development, enterprise Java systems, functional programming, distributed systems, scalable architecture, high-performance data storage and retrieval, asynchronous service oriented architecture\nAbility to work in an agile environment\nStrong problem solving skills\nSelf-motivated but self-awareness to know when to ask for assistance without delay\nPreferred Qualifications</p>\n\n<p>Experience with one or more of the following: General Java programming for performance and scalability, Java Servlets, Javascript/HTML5, Java Swing, Erlang\nExperience with scene graph data structures and visualization concepts\nExperience with SNMP, BACNet, or Modbus protocols</p>\n\n<p>Panduit is a world-class developer and provider of leading-edge solutions that help customers optimize the physical infrastructure through simplification, agility, and operational efficiency. Panduit’s Unified Physical Infrastructure (UPI) based solutions give enterprises the capabilities to connect, manage and automate communications, computing, power, control and security systems for a smarter, unified business foundation. Strong relationships with technology leaders complemented with its global staff and unmatched service and support, make Panduit a valuable and trusted partner.</p>\n\n<p>In addition to going to Panduit.com website and looking at our Solutions site (<a href=\"http://www.panduit.com/Solutions/SolutionsOverview/index.htm\">http://www.panduit.com/Solutions/SolutionsOverview/index.htm</a>), please also note that Panduit was recently named by Information Week as one of the Top 500 Innovators.</p>\n","how_to_apply":"<p>Apply using the following link:\n<a href=\"https://hiring.accolo.com/jobs/Folsom/California/Software_Engineer/377494563/job.htm\">https://hiring.accolo.com/jobs/Folsom/California/Software_Engineer/377494563/job.htm</a></p>\n","company":"Panduit","company_url":"http://www.panduit.com","company_logo":"http://github-jobs.s3.amazonaws.com/c1d1acae-3fb3-11e5-9927-1bab3bbce392.jpg","url":"http://jobs.github.com/positions/c5b82424-3fb3-11e5-9e7b-3559b0035d4b"},{"id":"4e5af222-3f85-11e5-93ae-5a5716c53757","created_at":"Mon Aug 10 17:42:15 UTC 2015","title":"Software Engineer (Generalist)","location":"Costa Mesa, CA","type":"Full Time","description":"<p>Build the next generation employment platforms, and help great companies find great people.</p>\n\n<p>Connectifier is changing the way recruiting is done today. Our engineering team from Google, Microsoft Research, Berkeley National Lab, Carnegie Mellon, and Stanford is building large scale data analysis software that processes professional profiles from all around the web. By analyzing code repos, blogs, and social profiles we&#39;re helping recruiters and hiring managers connect more efficiently with the candidates best for their openings.</p>\n\n<p>We are deployed at 25% of the Fortune-100, and our revenue is growing extremely fast. At Connectifier you&#39;ll get to work with top growing companies and fantastic brand names and deliver a best in class product.</p>\n\n<p>Example projects</p>\n\n<p>Build a predictive model of employee success based on a dataset of millions of people</p>\n\n<p>Build infrastructure for running distributed, restartable tasks on a cluster of machines</p>\n\n<p>Requirements</p>\n\n<p>Bachelors Degree in Computer Science or commensurate work experience</p>\n\n<p>Software engineering work or internship experience</p>\n\n<p>Preferred experience</p>\n\n<p>Application of algorithmic knowledge and intuition to solve complex problems</p>\n\n<p>Experience building software with a statically-typed backend language (Java preferred. C, C++, Scala, etc. are all sufficient)</p>\n\n<p>Knowledge of machine learning and web technologies are a plus</p>\n\n<p>About Connectifier, Inc.</p>\n\n<p>At Connectifier you&#39;ll learn from truly world-class engineers on a team that brought most of our culture from Google. You&#39;ll work on some of the hardest and most interesting problems in the world, and your solutions will help companies grow faster and help people find jobs they love. Our customers include 25% of the Fortune-100 and hundreds of other companies.</p>\n\n<p>We hire generalists who can solve any problem they come up against. We look for solid fundamentals, a willingness to learn, and ambition to do great things.</p>\n\n<p>The Perks of Working at Connectifier</p>\n\n<p>Highly competitive compensation package includes equity</p>\n\n<p>100% employee coverage for medical, dental, life, and disability insurance along with a 401k</p>\n\n<p>Take The Time You Need vacation policy</p>\n\n<p>Paid Gym Membership</p>\n\n<p>Frequent company trips, local events and team activities</p>\n\n<p>Catered lunches (5 days per week) and a kitchen stocked with beverages and snacks</p>\n","how_to_apply":"<p>Click here to apply: <a href=\"http://grnh.se/vofa0w\">http://grnh.se/vofa0w</a></p>\n\n<p>Be prepared to answer technical questions and write code to solve very challenging problems during the initial phone interview, a 5 hour on-site (or video chat) interview and on-site coding project.</p>\n","company":"Connectifier","company_url":"http://connectifier.com","company_logo":"http://github-jobs.s3.amazonaws.com/3fb77768-3f85-11e5-82c2-2670839b197c.png","url":"http://jobs.github.com/positions/4e5af222-3f85-11e5-93ae-5a5716c53757"},{"id":"42e4030e-3f6a-11e5-9f57-ac924703a68e","created_at":"Mon Aug 10 14:16:25 UTC 2015","title":"WEB DEVELOPER","location":"Chicago, IL","type":"Full Time","description":"<h3>The Job</h3>\n\n<p>The Citizen Science department at the Adler Planetarium is seeking an experienced full-stack\ndeveloper to build web apps and infrastructure for the Zooniverse (<a href=\"http://www.zooniverse.org\">www.zooniverse.org</a>), home\nto the web&#39;s best and most popular citizen science projects.</p>\n\n<p>As a Zooniverse developer, you’ll work with our team of talented and friendly developers and\nsupport staff to build unique, intuitive, and user-friendly web apps that enable anyone to\nparticipate in real research online. You’ll work on a variety of projects to support our cutting edge\nplatform that helps make real contributions to research in the sciences and humanities.</p>\n\n<h3>Who we are</h3>\n\n<p>We&#39;re a group of developers, educators, and researchers at the Adler Planetarium, creating\nonline citizen science web apps that change the world. Though we work on a peninsula in the\nmiddle of a lake (with the best views in Chicago!), our work is not insular. We collaborate with\nthe Adler&#39;s education, astronomy, collections, public programs, and experience design\ndepartments; we work closely with our University of Oxford Zooniverse team; we partner with\nworld-leading universities and research institutions from Tanzania to Tokyo; and our websites\nare visited by over a million passionate citizen scientists from more than 195 countries.</p>\n\n<h3>What we do</h3>\n\n<p>We take huge quantities of data and create web apps that allow people to make a real\ncontribution to research by exploring and classifying the data. Our projects contribute to\nresearch in zoology, astronomy, climatology, and more. Just a sampling of our projects enable\nour web visitors to find new planets, listen to bat calls, classify distant galaxies, track animals in\nthe Serengeti, transcribe WWI ships&#39; weather records, and help scientists find cures for cancer.</p>\n\n<h3>Who you are</h3>\n\n<p>You’re passionate about building really cool and purposeful stuff for the web. You love web\ndevelopment, and take satisfaction in delivering high-quality interfaces and infrastructure for a\nglobal user base.</p>\n\n<p>You’re flexible and can contribute to a wide variety of software-development tasks and projects.\nYou stay current in best practices, developments, and trends in developing for the web and\nmobile devices.</p>\n\n<p>You work well with other developers, and with development support staff—designers,\neducators, and communicators—to produce interfaces that work well across the board. You\nunderstand the importance of clear communication, visual, verbal, and written. You respect\ndeadlines and help your team stick to them.</p>\n\n<p>You&#39;re happy with a job that sometimes extends beyond the 9-5, but rarely feels like work.\nYou&#39;re excited by the opportunity to work in a leading space-science institution and to learn\nabout all research disciplines in general. You might not know what a bat sounds like, or what a\nradio galaxy is, but you can&#39;t wait to find out.</p>\n\n<h3>You have…</h3>\n\n<p>Experience developing complex web/mobile applications\nExperience with front-end and back-end development, including JavaScript/HTML/CSS skills.\nExperience working with relational databases.\nComfort working with Git and GitHub (or an equivalent version control system).</p>\n\n<h3>Bonus points if you also have…</h3>\n\n<p>Experience with RESTful APIs, cloud infrastructure, and custom APIs.\nExperience working with modern web frameworks, e.g. Ruby on Rails, Django, Grails, Pylons.\nPre-existing interest in or willingness to learn more about data querying and visualization.\nA demonstrable interest in academic crowdsourcing.</p>\n\n<h3>Benefits</h3>\n\n<p>Full-time position available immediately for an initial 12 months, with possibility for extension\nComprehensive benefits package</p>\n\n<h3>Perks</h3>\n\n<p>Work trips to our office in Oxford, England\nParticipation in conferences\nChoice of equipment\nFlexible work schedule\nFree entrance to local Chicago area museums and cultural institutions as well as all American\nAssociation of Museum Members and Association of Science and Technology Centers (via your\nAdler ID badge)</p>\n\n<p>For more information and to apply, visit our website: <a href=\"http://www.adlerplanetarium.org/jobs\">http://www.adlerplanetarium.org/jobs</a></p>\n\n<p>For consideration, please provide a cover letter and resume.</p>\n","how_to_apply":"<p>For more information and to apply, visit our website: <a href=\"http://www.adlerplanetarium.org/jobs\">http://www.adlerplanetarium.org/jobs</a></p>\n","company":"Zooniverse","company_url":"https://www.zooniverse.org/","company_logo":"http://github-jobs.s3.amazonaws.com/10983cee-3f6a-11e5-9718-fa88dc7423eb.png","url":"http://jobs.github.com/positions/42e4030e-3f6a-11e5-9f57-ac924703a68e"},{"id":"b02109f8-16c5-11e5-9106-8d97339405b2","created_at":"Sat Aug 08 20:56:42 UTC 2015","title":"Data DevOps Engineer","location":"San Francisco, CA, Washington, D.C.","type":"Full Time","description":"<p>Be part of a fast growing company whose primary focus is to improve and\nadvance health and health care using modern data technologies and end-user\nengagement. Rally Health is a private company of 270 employees with a\nmajor financial backing from UnitedHealth Group (with the market cap of\n$112B and the net income of $10B). We have partnered with several\ninsurance companies including UHG and other large corporations for user\nacquisition, clinical data feeds, and monetization.</p>\n\n<p>In this role you will be enabling analytics, data science, and business\nintelligence by deploying and maintaining infrastructure and data services\naround health risks, clinical and lifestyle recommendations, and population\nhealth management and reporting.</p>\n\n<p>Our technologies: AWS, Scala, Play, Hadoop (CDH), Kafka, Spark and Spark\nStreaming, MongoDB, Vagrant, Jenkins, Chef</p>\n\n<p><strong>Responsibilities:</strong></p>\n\n<ul>\n<li>Maintain, enhance, and optimize the data pipeline in a highly available,\nscalable, and robust manner<br></li>\n<li>Provision, configure and deploy new infrastructure and services<br></li>\n<li>Design, manage, and maintain tools to automate operational processes<br></li>\n<li>Contribute to making our infrastructure simple, reliable, and easy to\noperate<br></li>\n<li>Maintain and enhance monitoring and alerting<br></li>\n</ul>\n\n<p><strong>Requirements:</strong></p>\n\n<ul>\n<li>Experience in operations and Linux systems engineering in a cloud\nenvironment<br></li>\n<li>Mastery of a configuration management tool, such as Chef, Puppet,\nAnsible, Salt<br></li>\n<li>Programming experience in Python or a similar language<br></li>\n<li>Experience with CI, Jenkins and Continuous Deployment<br></li>\n<li>Experience with WebApps and Nginx<br></li>\n<li>Experience with monitoring (Sensu, Nagios) and metrics (Graphite,\nLibrato, statsd)<br></li>\n<li>Knowledge of security best practices<br></li>\n<li>Ability to track down root causes and fix them in systematic ways<br></li>\n<li>Strong problem solving skills and attention to detail<br></li>\n<li>Self-starter and results-oriented<br></li>\n</ul>\n\n<p><strong>And for bonus points:</strong></p>\n\n<ul>\n<li>Experience setting up and maintaining a Hadoop cluster<br></li>\n<li>Experience with data pipeline technologies, especially Kafka<br></li>\n<li>Experience with containers (Docker, LXC)</li>\n</ul>\n","how_to_apply":"<p><a href=\"http://grnh.se/0uno2w\">Apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/9057f028-16c5-11e5-89e7-e2e1851e0b86.png","url":"http://jobs.github.com/positions/b02109f8-16c5-11e5-9106-8d97339405b2"},{"id":"41e6d094-0ebe-11e5-90e8-3967eb7d4ab3","created_at":"Sat Aug 08 15:43:21 UTC 2015","title":"Senior/Principal Software Data Engineer","location":"Washington, DC or San Francisco, CA","type":"Full Time","description":"<p>Be part of a fast growing company whose primary focus is to improve and\nadvance health and health care using modern data technologies and end-user\nengagement. Rally Health is a private company of 250 employees with a\nmajor financial backing from UnitedHealth Group (with the market cap of\n$112B and the net income of $10B). We have partnered with several\ninsurance companies including UHG and other large corporations for user\nacquisition, clinical data feeds, and monetization.</p>\n\n<p>In this role you will be enabling analytics, data science, and business\nintelligence by creating infrastructure and building data services around\nhealth risks, clinical and lifestyle recommendations, and population health\nmanagement and reporting.</p>\n\n<p>Our technologies: Scala, Play, Hadoop (CDH), Kafka, Spark and Spark\nStreaming, MongoDB</p>\n\n<p>Responsibilities:</p>\n\n<ul>\n<li>Create and enhance data services including recommendations, health\nrisks, and A/B testing</li>\n<li>Maintain, enhance, and optimize the data pipeline</li>\n<li>Instrument new data sources</li>\n<li>Support reporting and business intelligence</li>\n</ul>\n\n<p>Requirements:</p>\n\n<ul>\n<li>Command of Scala, Java, or a similar language (Scala itself is not\nrequired)</li>\n<li>Command of SQL</li>\n<li>Command of data structures and algorithms</li>\n<li>Experience with Hadoop computational and storage layers. Spark\nexperience is a plus</li>\n<li>Strong knowledge of distributed systems and application design</li>\n<li>Ability to track down root causes and fix them in systematic ways</li>\n<li>Analytical with strong problem solving skills and attention to detail</li>\n<li>Self-starter and results-oriented</li>\n</ul>\n\n<p>And for bonus points, experience with the following technologies and\nconcepts:</p>\n\n<ul>\n<li>CDH Ops</li>\n<li>MongoDB / NoSQL</li>\n<li>AWS</li>\n<li>Web frameworks</li>\n<li>Recommendation and rules-based engines</li>\n<li>Configuration management tools (Chef, Puppet, Ansible, Salt),\nmonitoring (Sensu, Nagios) and metrics (Graphite, Librato, statsd)</li>\n</ul>\n","how_to_apply":"<p><a href=\"http://grnh.se/3qdgf8\">Please apply here</a></p>\n","company":"Rally Health","company_url":"http://www.rallyhealth.com","company_logo":"http://github-jobs.s3.amazonaws.com/3e6e505e-0ebe-11e5-97ed-ac2973139872.png","url":"http://jobs.github.com/positions/41e6d094-0ebe-11e5-90e8-3967eb7d4ab3"},{"id":"8207eece-3d35-11e5-92e2-2d6c15131a96","created_at":"Fri Aug 07 18:53:28 UTC 2015","title":"Software Engineer (Remote work possible)","location":"Santa Monica, CA","type":"Full Time","description":"<p>We believe every patient should receive quality healthcare.</p>\n\n<p>As a software engineer at Advanced Medical Reviews (AMR), you will be contributing to the development and support of a web based application servicing the Independent Medical Review space. The company is well established and experiencing extremely strong growth domestically and internationally.  </p>\n\n<p>AMR is currently looking for talented professionals who are passionate about the software they create and strive to keep up-to-date with the latest tools and technologies.</p>\n\n<p>We are a fast growing, tight knit team of professionals with a “can do” attitude and expect the same of any new members.  The team is fully virtual with members across the US and overseas. Employees work from their home offices and will require demonstrated self-directed skills.</p>\n\n<p>Basic Responsibilities:</p>\n\n<ul>\n<li>Contributing to a collaborative design process within a small team that includes developers and subject matter experts</li>\n<li>Designing and coding new features</li>\n<li>Maintaining and refactoring existing modules and periodic direct interaction with customers in support of the product </li>\n</ul>\n\n<p>Position Requirements:</p>\n\n<ul>\n<li>5+ years professional software development experience</li>\n<li>C#, .NET 4.5, object-oriented programming experience</li>\n<li>LINQ/Microsoft Entity Framework 6+ experience</li>\n<li>SQL Server 2012 / T-SQL, experience writing stored procedures &amp; functions</li>\n<li>Experience using Git/GitHub source control</li>\n<li>Knowledge of ASP.NET Web Forms development</li>\n<li>Excellent interpersonal skills and requirements analysis experience</li>\n<li>Strong analytical abilities and a drive to solve complex problems</li>\n<li>Ability to consistently deliver results on time while working independently</li>\n<li>Excellent written, verbal and collaborative skills</li>\n</ul>\n\n<p>Preferred Qualifications:</p>\n\n<ul>\n<li>Experience with ASP.NET MVC</li>\n<li>Experience with Knockout, AngularJS or other client-side Javascript frameworks</li>\n<li>Active GitHub profile or contributions to open source projects</li>\n</ul>\n\n<p>Education:</p>\n\n<ul>\n<li>Bachelor’s degree in Computer Science or 5+ years of professional software development experience</li>\n</ul>\n\n<p>Compensation/Benefits: </p>\n\n<ul>\n<li>100% telecommute position</li>\n<li>Competitive salary</li>\n<li>Medical, Dental and Vision coverage</li>\n<li>401k with employer match</li>\n<li>Vacation, Sick and Holiday pay</li>\n</ul>\n\n<p>Please go to: <a href=\"http://tiny.cc/AMRJOBS\">http://tiny.cc/AMRJOBS</a> to apply for this position. \nPlease do not reply to this ad via e-mail, simply go to the website to apply.  </p>\n\n<p>About our company:\nAs a URAC accredited Independent Review Organization (IRO), Advanced Medical Reviews delivers a single source solution for our clients’ managed healthcare administration needs.</p>\n\n<p>Utilizing numerous quality assurance protocols, a highly trained compliance staff, and three “in-house” medical directors, our clients are assured the highest quality standard throughout the review process. Advanced Medical Reviews assists our clients to increase their operational efficiency through specialized reports, data mining, and technology integration.</p>\n\n<p>Our commitment is to provide our clients with a fully integrated, compliant, and cost-effective service emphasizing continuous quality improvement, innovation, and client satisfaction.</p>\n","how_to_apply":"<p><a href=\"http://tiny.cc/AMRJOBS\">http://tiny.cc/AMRJOBS</a></p>\n","company":"Advanced Medical Reviews","company_url":"http://www.admere.com","company_logo":"http://github-jobs.s3.amazonaws.com/428addf6-3d35-11e5-9197-3144e8f8a8bd.png","url":"http://jobs.github.com/positions/8207eece-3d35-11e5-92e2-2d6c15131a96"},{"id":"754de710-3d1c-11e5-9fad-6c8a25dbe537","created_at":"Fri Aug 07 15:54:20 UTC 2015","title":"Web Developer","location":"New York, NY","type":"Full Time","description":"<p>POSITION SUMMARY </p>\n\n<p>The Simons Foundation in New York City is seeking a Web Developer to fill a full-time position in its informatics group.</p>\n\n<p>This role will support the creation and maintenance of several websites hosting editorially independent online publications covering research in autism, data and life sciences, mathematics and physics, as well as sites providing information about the foundation&#39;s support of basic and applied research.</p>\n\n<p>ESSENTIAL FUNCTIONS/RESPONSIBILITIES</p>\n\n<ul>\n<li>Support back-end WordPress development for a diverse collection of foundation-affiliated websites</li>\n<li>Create robust web templates and plugins utilizing the latest WordPress features</li>\n<li>Work collaboratively and closely with editors, front-end designers, web producers and other developers</li>\n<li>Effectively manage priorities for multiple, concurrent projects</li>\n</ul>\n\n<p>MINIMUM QUALIFICATIONS</p>\n\n<p>Experience</p>\n\n<ul>\n<li>Expert-level website development in WordPress, PHP and MySQL</li>\n<li>Deep understanding of HTML and CSS</li>\n<li>Experience with JavaScript and jQuery</li>\n<li>Experience with responsive web design, integration testing and usability testing</li>\n<li>Experience with high volume websites</li>\n<li>Proficient in version control tools such as Git and SVN</li>\n<li>Portfolio of work that functions well on multiple device types</li>\n<li>Excellent communication skills</li>\n</ul>\n\n<p>The Simons Foundation is an Equal Opportunity Employer, M/F/D/V.</p>\n\n<p>To apply, send CV to <a href=\"mailto:web-dev-job@simonsfoundation.org\">web-dev-job@simonsfoundation.org</a></p>\n\n<p>Contact Us: <a href=\"mailto:web-dev-job@simonsfoundation.org\">web-dev-job@simonsfoundation.org</a></p>\n","how_to_apply":"<p>Email Address:  <a href=\"mailto:web-dev-job@simonsfoundation.org\">web-dev-job@simonsfoundation.org</a></p>\n","company":"Simons Foundation","company_url":null,"company_logo":null,"url":"http://jobs.github.com/positions/754de710-3d1c-11e5-9fad-6c8a25dbe537"},{"id":"093ca00e-3bd0-11e5-8b95-41739407f12c","created_at":"Thu Aug 06 17:58:48 UTC 2015","title":"Technical Content Creator","location":"SF Bay Area or Remote","type":"Full Time","description":"<p>As our new technical marketer, you will be creating content to drive awareness for Compose as well as help new and current customers become more proficient running databases. If you have strong writing skills, love working with the latest engineering technology, and can distill complex ideas for broad audiences, this may be a good fit for you.</p>\n\n<p>You should have a basic understanding of how databases are used in modern web app development. You must have strong writing chops, be able to communicate database concepts to novice and experienced developers, and articulate how Compose can help customers with their data strategy. On any day you may manage development of new customer quick-start guides, create tutorials, or write use cases. You&#39;ll also develop new website content, videos and interactive tours for different audiences. A background in computer science, technical writing, software development and/or database administration is going to be a big help.</p>\n\n<p>Compose is small enough that you&#39;ll be able to make a significant impact on the company&#39;s trajectory, yet big enough that there is plenty of support and boundless opportunity for growth. Work from anywhere, enjoy challenging and rewarding responsibilities, and have a meaningful work/life balance at a company that&#39;s growing fast. Our team is smart, friendly, fun, and incredibly helpful, and you&#39;ll have a ton of resources to help you get started and be successful.</p>\n","how_to_apply":"<p>Email us at <a href=\"mailto:%20jobs+marketing@compose.io?subject=technical+content+creator\">jobs+marketing@compose.io</a> and tell us a little about yourself, why you&#39;re interested in the role and Compose, and share a story about a database you&#39;ve used what you loved or hated about it.</p>\n","company":"Compose","company_url":"http://www.compose.io","company_logo":"http://github-jobs.s3.amazonaws.com/e77751b2-3bcf-11e5-80ed-6630ac9bb43a.png","url":"http://jobs.github.com/positions/093ca00e-3bd0-11e5-8b95-41739407f12c"},{"id":"eab6d14e-3c52-11e5-9874-7df8ce673119","created_at":"Thu Aug 06 15:52:29 UTC 2015","title":"IT Development Platform Engineer","location":"Houston, TX","type":"Full Time","description":"<p>WHAT IS OUR IT DEVELOPMENT PLATFORM:</p>\n\n<p>The integration and delivery of data, technology, and shared-services between IT and it’s customer via internally developed web technology that is modularized for our product development teams.</p>\n\n<hr>\n\n<p>WHAT IT DEVELOPMENT PLATFORM ENGINEERS DO:</p>\n\n<p>Our engineers are involved in all parts of the IT development platform product lifecycle and engagement processes: brainstorming, design, prototyping, planning, execution, and shipping. We brainstorm to understand and explore the difficult problem spaces we tackle, and work with our team of Jedi Knights to come up with solutions (product, visual, and technical) for the hardest problems we discover in the company. We code (there is a lot of coding and the code must flow), and finally, ship and own products that directly and invaluably impact the user and the company. We work with cutting edge web technologies and are avid fans of open source, science and science fiction, and cool coffee conversations about our favorite geek musings.</p>\n\n<hr>\n\n<p>TECHNOLOGIES WE LOVE:</p>\n\n<ul>\n<li><p>Full-Stack Integration: Javascript and AMP, MEAN, and others</p></li>\n<li><p>MySQL and NoSQL Database Environments</p></li>\n<li><p>Common extensive javascript libraries like ExtJS, Angular, and jQuery</p></li>\n<li><p>Internal frameworks that we’ve crafted to serve our rapid iteration</p></li>\n<li><p>Flux Capacitors, oh yes, Flux Capacitors</p></li>\n</ul>\n\n<hr>\n\n<p>WHAT WE VALUE:</p>\n\n<ul>\n<li><p>You&#39;re cool with working with others in complex and dynamic systems environments. Our jobs aren’t done in a mysterious magical black box and everyone contributes to get the job done.</p></li>\n<li><p>You’re not afraid to make mistakes because without challenge, you’re not learning. Oh, and we’re not afraid to let you fail either.</p></li>\n<li><p>Speaking of learning, you have a constant desire to grow and develop. So do we and we’re not afraid to wield the cutting edge of new technology.</p></li>\n<li><p>You’re attuned to the Light side and grasp that the Dark Side truly does not have cookies.</p></li>\n<li><p>You care about great design, not only in the product and visual sense, but also in your code and technical architecture.</p></li>\n<li><p>Your stakeholder is your focus.</p></li>\n<li><p>You are comfortable with both large-scale and iterative development styles.</p></li>\n<li><p>You might even own the One Ring, have defeated a Sarlaac in an interstellar battle to the death, or a sandworm is your idea of an invigorating ride into the office.</p></li>\n</ul>\n","how_to_apply":"<p>Apply now at our online career page: <a href=\"http://www.qrigroup.com/careers\">www.qrigroup.com/careers</a></p>\n","company":"QRI","company_url":"http://www.qrigroup.com","company_logo":"http://github-jobs.s3.amazonaws.com/8ac18b40-3c4c-11e5-87d3-6f98466ac4c1.png","url":"http://jobs.github.com/positions/eab6d14e-3c52-11e5-9874-7df8ce673119"},{"id":"59ec0c5c-3a21-11e5-83fd-85f828d0c76d","created_at":"Mon Aug 03 20:53:21 UTC 2015","title":"Software Engineer, Geospatial Insights","location":"Philadelphia, PA","type":"Full Time","description":"<p>Overview</p>\n\n<p>Azavea uses geospatial data to build software for civic and social impact. We’re excited about what we do, we’re growing, and we hope you will join us.</p>\n\n<p>Azavea is based in Philadelphia, and we are looking to grow our Geospatial Insights team that develops custom web and mobile software for public health, climate change, law enforcement, elections and civic applications as well as our HunchLab, open source DistrictBuilder and Cicero products.</p>\n\n<p>We are looking for</p>\n\n<p>We’re looking for a software engineer that is passionate about building applications that will have a positive impact – someone interested in public service, but not necessarily interested in working for a government or a non-profit organization. We are looking for someone who thrives on working in a variety of technology environments, and wants to build visually slick applications that have well-engineered architectures and provide a responsive user experience.</p>\n\n<p>Skills &amp; Requirements</p>\n\n<p>Who we are and what we’re doing: \nAs a B Corporation, we’re committed to working on projects that have social and civic impact, and advancing the state-of-the-art through research. Most of our customers are local governments, non-profit organizations and academic or federal research projects. We build custom apps; perform geospatial analysis; manage several open source civic software projects (DistrictBuilder, OpenTreeMap and others); and develop an open source, high performance computing framework, GeoTrellis, that enables us to build fast analytical applications by distributing the geospatial data processing. Our developers work across the technology stack from database and application servers in the infrastructure layer to modern, browser-based front-ends.</p>\n\n<p>The Geospatial Insights team develops web mapping software for analysis and visualization of public health, homelessness, and elections, including supporting the open source legislative redistricting software, DistrictBuilder and our Cicero API. They are also developing two cutting edge products, a climate change data processing service and our HunchLab product, a web-based application for visualizing space-time events and geographic forecasting of crime risk. We apply a mix of clever software, math, statistics, machine learning and AWS clusters to create a powerful analysis tool that is being used to improve public safety in communities around the world. In addition, the team is working with academic researchers to implement software for crime geography analysis techniques that push forward the boundaries of what’s possible with contemporary data science.</p>\n\n<p>Our company and team are growing, and we need your help to scale up our development capacity on the Geospatial Insights team.</p>\n\n<p>What You’ll Do: </p>\n\n<ul>\n<li>Implement application code, APIs and web or mobile clients based on wireframes and designs developed by our UI/UX Design team. </li>\n<li>Engage in multidisciplinary work that applies an agile process (scrum board, daily stand-ups and two-week iterations) to database design, architecture, development, testing and deployment. </li>\n<li>Optimize database, server and client performance to create applications with both functional and responsive user experiences. </li>\n<li>Build, provision, and deploy servers in a repeatable way to a cloud environment. </li>\n<li>Contribute to both a growing company and to the open source communities that support our work.</li>\n</ul>\n\n<p>You should: </p>\n\n<ul>\n<li>Know how to build and support scalable web applications in Python/Django, or another MVC framework (C#/.Net, Ruby/Rails, JS/AngularJS, Java/JVM/Spring, Scala/Play). We do a lot of work in Python/Django, Javascript, and Scala and dabble in others depending on client and project requirements. </li>\n<li>Demonstrate fluency in core web technologies (HTML/CSS/JS) and contemporary Javascript libraries like jQuery, React, or AngularJS. </li>\n<li>Express solid understanding of MVC architecture, RESTful design patterns, and the DRY principle. </li>\n<li>Be comfortable managing VMs and working in a Linux environment. </li>\n<li>Be interested in working with a small, collaborative team on meaningful projects. </li>\n<li>Get excited about a diversity of both projects and technologies.</li>\n</ul>\n\n<p>You get extra points for: </p>\n\n<ul>\n<li>Background in math and statistics or experience with R. </li>\n<li>Experience with open source or commercial geospatial toolkits like OpenLayers, Leaflet, GeoServer, PostGIS, CartoDB, ArcGIS, and GoogleMaps. </li>\n<li>Experience with mobile apps (Objective C, Android or responsive HTML). </li>\n<li>Experience scaling apps within AWS. </li>\n<li>Experience provisioning servers with Ansible. </li>\n<li>Knowledge of distributed data processing frameworks, like Hadoop, Amazon MR, etc. </li>\n<li>Demonstrating your open source or other community service contributions.</li>\n</ul>\n\n<p>You’ll notice that we don’t say “X-Y years of experience” or “M.S. in Computer Science.” Formal credentials like these are not irrelevant, but we are primarily looking for people who have had experience successfully building sophisticated web applications. You might have had these kinds of experiences without a college degree. Or you may be just out of school but worked your way through school and had some great co-op experiences. Or you might have a math or humanities background but have a great head for software development. These are all potentially great backgrounds, and we’d be interested in hearing from you.</p>\n\n<p>Office and Benefits</p>\n\n<p>Our Philadelphia office is located in a brightly lit office on the 4th floor of a converted factory building in the Callowhill neighborhood, a short walk from Center City, the Reading Terminal Market and SEPTA subway and regional rail stations. For bicyclists, we have in-house bike parking, a shower and lockers. It’s an open office plan with several smaller rooms for team meetings, private space and concentration time. You get a top-end Linux workstation, Mac or Windows laptop with a pile of memory for VMs and extra monitors. We have flex-time to deal with personal stuff, and most people work a 40 – 45 hour week on a regular schedule. After the first six months, our developers can also spend up to 10% of their time on a geospatial open source, professional development, or R&amp;D project. For example, some of our colleagues are contributors to the PostGIS, OpenLayers, GDAL and GeoTrellis projects. Other research projects have included improving dev ops tool chains; using FFT for fast kernel density estimation; extending Scala for improved numeric handling; and hijacking GPUs for raster data processing. Once a quarter, we all get together to share our research and learning with our colleagues.</p>\n\n<p>We offer a salary commensurate with skills and experience and a benefits package that includes: profit-sharing bonus, health, dental, vision, retirement plan, flexible hours, and more. We welcome qualified candidates from all walks of life and value diversity in our company, and we prohibit discrimination based on race, color, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, veteran status, military service, disability unrelated to job requirements, marital status, or domestic partner status.</p>\n","how_to_apply":"<p><a href=\"http://grnh.se/skxw07\">http://grnh.se/skxw07</a></p>\n","company":"Azavea","company_url":"http://jobs.azavea.com","company_logo":null,"url":"http://jobs.github.com/positions/59ec0c5c-3a21-11e5-83fd-85f828d0c76d"},{"id":"a748b7a4-3a01-11e5-81a6-39c9cc8bc642","created_at":"Mon Aug 03 17:08:19 UTC 2015","title":"Associate Software Engineer","location":"Pullman, WA","type":"Full Time","description":"<p>The Opportunity</p>\n\n<p>Schweitzer Engineering Laboratories (SEL) seeks a professional, innovative and detailed individual for our Associate Software Engineer. If you are looking for an opportunity to work for a leader in the power industry, then this position is for you! </p>\n\n<p>SEL’s corporate office is located in Eastern Washington where you&#39;ll enjoy an unmatched quality of life. Enjoy the smaller town life: country space, freedom from traffic, easy access to recreational activities in nearby mountains, rivers, and forests, as well as great schools and universities. </p>\n\n<p>Responsibilities:</p>\n\n<p>Lead full cycle development of our mission critical products (software requirements, design, development, test, maintenance). \nProvide technical leadership. \nProvide solutions to technical issues and ensure solutions meet the technical specifications and design requirements. \nUnderstand hardware and software interactions, and collaborate with Hardware Engineers. \nEnsure the delivered solutions meet the technical specifications and design requirements. \nMentor Engineers, Associate Engineers, and Technicians. \nReview data sheets and instruction manuals. \nServe as project manager and/or project technical contact. \nParticipate in industry technical meetings and conferences as needed to meet operational and strategic plans. \nLead development of R&amp;D processes. </p>\n\n<p>Qualifications:</p>\n\n<p>B.S. in Electrical Engineering, Computer Science, Computer Engineering or equivalent \nExperience or knowledge in embedded systems firmware development \nStrong background in real-time firmware design \nKnowledge in C, C++, and assembly languages \nProven experience leading and completing complex projects \nStrong writing, documentation, and speaking skills \nAbility to learn new skills and assume new responsibilities \nAbility to work cooperatively in a team environment \nBackground check results satisfactory to SEL \nNegative drug test result(s) </p>\n\n<p>Preferred Qualifications:</p>\n\n<p>3-phase electric power systems \nModern communications protocols \nDigital and analog circuitry \nDigital communications and signal processing </p>\n\n<p>To Apply for This Position: \nWe ask all candidates to submit their resume through our website at <a href=\"http://www.selinc.com/applynow\">www.selinc.com/applynow</a>. If your qualifications and experience match any of our current openings, please submit your resume for that position so that you may be considered immediately. </p>\n\n<p>SEL sends an initial e-mail response to all applicants at time of resume submittal. If you do not receive this communication, please check your SPAM filter and make sure your system is not blocking e-mails from SEL. It is important that you ensure your receipt of this e-mail as SEL may communicate future position updates via e-mail. </p>\n\n<p>SEL is an Equal Opportunity/Affirmative Action Employer. </p>\n\n<p>An Award Winning Company\nSchweitzer Engineering Laboratories, Inc. (SEL) has earned a reputation for quality, reliability, integrity, and service. This has enabled us to expand within both the electric utility and industrial markets to include international customers and OEM markets. </p>\n\n<p>In 2012, SEL earned a spot on the FORTUNE Magazine 100 Best Companies to Work For list. This prestigious ranking celebrates the SEL 100% employee-owned culture as one of the best in the country. SEL has received numerous awards, including the Puget Sound Business Journal’s 100 Fastest-Growing Private Companies in Washington State (1999 through 2003, 2010, and 2011), Inc. Magazine’s 500|5000 Fastest Growing Private Companies (1990, 1991, 2008, 2010, and 2011), the Association of Washington Businesses (AWB) Manufacturing, Workplace, and Community Service Award (1998 through 2010), the Washington State Quality Achievement Award (WSQA), and the Washington Secretary of State Corporations for Communities Award (2010). Puget Sound Business Journal has also ranked SEL as one of Washington State’s Top 100 Largest Private Companies every year since 2007. </p>\n\n<p>In an independent survey conducted by Newton-Evans Research Company, SEL ranks first in all performance categories including: technology, features, security against hackers, web/internet information ability, technical service and support, maintenance cost, relay setting PC software, and price. Since 2006, SEL has also held the elite VPP STAR status certification from Washington State Department of Labor &amp; Industries. Less than 2,000 companies in the U.S. earn the VPP STAR status for outstanding safety and health programs. </p>\n\n<p>Apply Your Talent. Make a Difference. Enjoy the Rewards. \nAre you ready to be part of a highly motivated and well-equipped team? Are you a quick learner who likes new challenges? If so, then you are ready to join us at Schweitzer Engineering Laboratories. </p>\n\n<p>Dr. Edmund O. Schweitzer III delivered the first commercial digital protective relay in 1984. Under his technical, managerial, and fiscal leadership, Schweitzer Engineering Laboratories has expanded to become a leader in the power industry, employing over 3,700 people world-wide. Dr. Schweitzer understands and supports the need for investing in employees. In return, he expects that we hire only the best, most highly motivated team members, and that we deliver simple, reliable, and cost-effective products and solutions. </p>\n\n<p>Our products and solutions must be simple and reliable because they protect the largest, most complicated machine on earth: the electric power grid. Blackouts in the U.S. and Canada remind us that reliable electric power is crucial to our society. SEL provides systems, services, and products for the protection, monitoring, control, automation, and metering of utility and industrial electric systems worldwide. </p>\n\n<p>Our company and our products exist to make electric power safer, more reliable, and more economical. That purpose has made SEL very successful, and the company is managed with sound fiscal judgment and that purpose in mind. Profits are reinvested to fuel the company’s growth. </p>\n\n<p>In addition to offering a variety of challenges in a supportive, stable environment, SEL shares its success with employees through our Employee Stock Ownership Program. Its purpose is to involve employees in the company’s long-term success and to encourage employees’ motivation, creativity, and productivity. Once employees become eligible, SEL will contribute a certain percentage of employees’ salaries, above their normal compensation, to accrue company stock with pre-tax dollars in their account. </p>\n\n<p>Employee Testimonial Video: SEL employees describe the opportunity and rewards of a career working at a 100% employee owned company! Learn more about SEL on YouTube <a href=\"http://www.youtube.com/watch?v=sMyhbe7Hklo\">www.youtube.com/watch?v=sMyhbe7Hklo</a> </p>\n\n<p>Benefits: SEL has an excellent benefits package including medical, dental, and vision for all regular full-time employees and their entire family; long-term disability and life insurance; education assistance programs; a very generous employee stock ownership plan; 401K; flexible benefit account; and an outstanding work environment.</p>\n","how_to_apply":"<p><a href=\"https://www5.recruitingcenter.net/Clients/SELInc/PublicJobs/controller.cfm?jbaction=JobProfile&amp;Job_Id=18582&amp;esid=az\">https://www5.recruitingcenter.net/Clients/SELInc/PublicJobs/controller.cfm?jbaction=JobProfile&amp;Job_Id=18582&amp;esid=az</a></p>\n","company":"Schweitzer Engineering Laboratories","company_url":"http://www.selinc.com/careers","company_logo":"http://github-jobs.s3.amazonaws.com/9ee7417a-3a01-11e5-9760-dd53a9637f3b.jpg","url":"http://jobs.github.com/positions/a748b7a4-3a01-11e5-81a6-39c9cc8bc642"}]